[
  {
    "name": "Hip Circles (Prone)",
    "type": "stretching",
    "muscle": "abductors",
    "equipment": "None",
    "difficulty": "intermediate",
    "instructions": "Position yourself on your hands and knees on the ground. Maintaining good posture, raise one bent knee off of the ground. This will be your starting position. Keeping the knee in a bent position, rotate the femur in an arc, attempting to make a big circle with your knee. Perform this slowly for a number of repetitions, and repeat on the other side."
  },
  {
    "name": "Standing Hip Circles",
    "type": "stretching",
    "muscle": "abductors",
    "equipment": "body_only",
    "difficulty": "beginner",
    "instructions": "Begin standing on one leg, holding to a vertical support. Raise the unsupported knee to 90 degrees. This will be your starting position. Open the hip as far as possible, attempting to make a big circle with your knee. Perform this movement slowly for a number of repetitions, and repeat on the other side."
  },
  {
    "name": "Clam",
    "type": "strength",
    "muscle": "abductors",
    "equipment": "None",
    "difficulty": "intermediate",
    "instructions": "Begin by lying on your side on the ground. Support your head on your left arm. Flex the hips to 45 degrees and the knees to approximately 90 degrees, with your right leg directly on top of your left. This will be your starting position. Initiate the exercise by abducting your right leg, pushing your knee away from the midline of your body. Maintain contact between your feet throughout the movement. Pause at the top of the motion, and then return to the starting position. Repeat for the desired number of repetitions. Do both sides."
  },
  {
    "name": "Iliotibial band SMR",
    "type": "stretching",
    "muscle": "abductors",
    "equipment": "foam_roll",
    "difficulty": "intermediate",
    "instructions": "Lay on your side, with the bottom leg placed onto a foam roller between the hip and the knee. The other leg can be crossed in front of you. Place as much of your weight as is tolerable onto your bottom leg; there is no need to keep your bottom leg in contact with the ground. Be sure to relax the muscles of the leg you are stretching. Roll your leg over the foam from you hip to your knee, pausing for 10-30 seconds at points of tension. Repeat with the opposite leg."
  },
  {
    "name": "Thigh abductor",
    "type": "strength",
    "muscle": "abductors",
    "equipment": "machine",
    "difficulty": "intermediate",
    "instructions": "To begin, sit down on the abductor machine and select a weight you are comfortable with. When your legs are positioned properly, grip the handles on each side. Your entire upper body (from the waist up) should be stationary. This is the starting position. Slowly press against the machine with your legs to move them away from each other while exhaling. Feel the contraction for a second and begin to move your legs back to the starting position while breathing in. Note: Remember to keep your upper body stationary to prevent any injuries from occurring. Repeat for the recommended amount of repetitions."
  },
  {
    "name": "Fire Hydrant",
    "type": "strength",
    "muscle": "abductors",
    "equipment": "body_only",
    "difficulty": "beginner",
    "instructions": "Position yourself on your hands and knees on the ground. This will be your starting position. Keeping the knee in a bent position, abduct the femur, moving your knee away from the midline of the body. Pause at the top of the motion, and then slowly return to the starting position. Perform this slowly for a number of repetitions, and repeat on the other side."
  },
  {
    "name": "Windmills",
    "type": "stretching",
    "muscle": "abductors",
    "equipment": "body_only",
    "difficulty": "intermediate",
    "instructions": "Lie on your back with your arms extended out to the sides and your legs straight. This will be your starting position. Lift one leg and quickly cross it over your body, attempting to touch the ground near the opposite hand. Return to the starting position, and repeat with the opposite leg. Continue to alternate for 10-20 repetitions."
  },
  {
    "name": "Monster Walk",
    "type": "strength",
    "muscle": "abductors",
    "equipment": "body_only",
    "difficulty": "intermediate",
    "instructions": "Place a band around both ankles and another around both knees. There should be enough tension that they are tight when your feet are shoulder width apart. To begin, take short steps forward alternating your left and right foot. After several steps, do just the opposite and walk backward to where you started."
  },
  {
    "name": "IT Band and Glute Stretch",
    "type": "stretching",
    "muscle": "abductors",
    "equipment": "body_only",
    "difficulty": "intermediate",
    "instructions": "Loop a belt, rope, or band around one of your feet, and swing that leg across your body to the opposite side, keeping the leg extended as you lay on the ground. This will be your starting position. Keeping your foot off of the floor, pull on the belt, using the tension to pull the toes up. Hold for 10-20 seconds, and repeat on the other side."
  },
  {
    "name": "Single-leg lying cross-over stretch",
    "type": "stretching",
    "muscle": "abductors",
    "equipment": "body_only",
    "difficulty": "beginner",
    "instructions": "Lie on your back with your legs extended. Cross one leg over your body with the knee bent, attempting to touch the knee to the ground. Your partner should kneel beside you, holding your shoulder down with one hand and controlling the crossed leg with the other. this will be your starting position. Attempt to raise the bent knee off of the ground as your partner prevents any actual movement. After 10-20 seconds, relax the leg as your partner gently presses the knee towards the floor. Repeat with the other side."
  },
  {
    "name": "Standing hip circle",
    "type": "stretching",
    "muscle": "abductors",
    "equipment": "body_only",
    "difficulty": "intermediate",
    "instructions": "Brace yourself a couple of feet back from a sturdy object and stand on one foot, knee unlocked and leaning forward slightly. Standing on one leg, lift up on to your toes while keeping your other foot off the ground. This will be your starting position. In a circular motion, rotate your entire leg both forwards and backwards for a number of repetitions to loosen up the hips. Keep your foot off the floor the entire time. Repeat for the opposite side."
  },
  {
    "name": "Lateral Band Walk",
    "type": "strength",
    "muscle": "abductors",
    "equipment": "bands",
    "difficulty": "intermediate",
    "instructions": "Position a band around your lower legs. The resistance can be applied closer to the knees for an easier movement or around the ankles or feet for a more advanced movement. With the band in place, assume an athletic standing position, with the knees and hips slightly bent, feet shoulder-width apart, and the head and chest up. This will be your starting position. Staying low, take a slow, lateral step. Keep your toes pointed forward and stay low. After completing the step, follow with the opposite leg. Step slowly, resisting the band. Keep the feet at least shoulder width apart to maintain band tension. Continue to laterally step in this manner to complete the set for the desired number of repetitions before switching to walk in the opposite direction."
  },
  {
    "name": "Dynamic pigeon stretch",
    "type": "strength",
    "muscle": "abductors",
    "equipment": "body_only",
    "difficulty": "intermediate",
    "instructions": ""
  },
  {
    "name": "Cross-over jack",
    "type": "strength",
    "muscle": "abductors",
    "equipment": "body_only",
    "difficulty": "intermediate",
    "instructions": ""
  },
  {
    "name": "Traveling thigh killa",
    "type": "strength",
    "muscle": "abductors",
    "equipment": "body_only",
    "difficulty": "intermediate",
    "instructions": ""
  },
  {
    "name": "FYR Thigh Killa",
    "type": "strength",
    "muscle": "abductors",
    "equipment": "body_only",
    "difficulty": "intermediate",
    "instructions": ""
  },
  {
    "name": "HM Straddle Stretch",
    "type": "stretching",
    "muscle": "abductors",
    "equipment": "body_only",
    "difficulty": "intermediate",
    "instructions": ""
  },
  {
    "name": "HM Right Leg Swing",
    "type": "stretching",
    "muscle": "abductors",
    "equipment": "body_only",
    "difficulty": "intermediate",
    "instructions": ""
  },
  {
    "name": "HM Right Side-Kick",
    "type": "stretching",
    "muscle": "abductors",
    "equipment": "body_only",
    "difficulty": "intermediate",
    "instructions": ""
  },
  {
    "name": "Thigh adductor",
    "type": "strength",
    "muscle": "adductors",
    "equipment": "machine",
    "difficulty": "intermediate",
    "instructions": "To begin, sit down on the adductor machine and select a weight you are comfortable with. When your legs are positioned properly on the leg pads of the machine, grip the handles on each side. Your entire upper body (from the waist up) should be stationary. This is the starting position. Slowly press against the machine with your legs to move them towards each other while exhaling. Feel the contraction for a second and begin to move your legs back to the starting position while breathing in. Note: Remember to keep your upper body stationary and avoid fast jerking motions in order to prevent any injuries from occurring. Repeat for the recommended amount of repetitions."
  },
  {
    "name": "Groiners",
    "type": "stretching",
    "muscle": "adductors",
    "equipment": "body_only",
    "difficulty": "beginner",
    "instructions": "Begin in a pushup position on the floor. This will be your starting position. Using both legs, jump forward landing with your feet next to your hands. Keep your head up as you do so. Return to the starting position and immediately repeat the movement, continuing for 10-20 repetitions."
  },
  {
    "name": "Band Hip Adductions",
    "type": "strength",
    "muscle": "adductors",
    "equipment": "bands",
    "difficulty": "beginner",
    "instructions": "Anchor a band around a solid post or other object. Stand with your left side to the post, and put your right foot through the band, getting it around the ankle. Stand up straight and hold onto the post if needed. This will be your starting position. Keeping the knee straight, raise your right legs out to the side as far as you can. Return to the starting position and repeat for the desired rep count. Switch sides."
  },
  {
    "name": "Side Leg Raises",
    "type": "stretching",
    "muscle": "adductors",
    "equipment": "body_only",
    "difficulty": "beginner",
    "instructions": "Stand next to a chair, which you may hold onto as a support. Stand on one leg. This will be your starting position. Keeping your leg straight, raise it as far out to the side as possible, and swing it back down, allowing it to cross the opposite leg. Repeat this swinging motion 5-10 times, increasing the range of motion as you do so."
  },
  {
    "name": "Lateral hop",
    "type": "plyometrics",
    "muscle": "adductors",
    "equipment": "body_only",
    "difficulty": "intermediate",
    "instructions": "Assume a half squat position facing 90 degrees from your direction of travel. This will be your starting position. Allow your lead leg to do a countermovement inward as you shift your weight to the outside leg. Immediately push off and extend, attempting to bound to the side as far as possible. Upon landing, immediately push off in the opposite direction, returning to your original start position. Continue back and forth for several repetitions."
  },
  {
    "name": "Groin and Back Stretch",
    "type": "stretching",
    "muscle": "adductors",
    "equipment": "none",
    "difficulty": "beginner",
    "instructions": "Sit on the floor with your knees bent and feet together. Interlock your fingers behind your head. This will be your starting position. Curl downwards, bringing your elbows to the inside of your thighs. After a brief pause, return to the starting position with your head up and your back straight. Repeat for 10-20 repetitions."
  },
  {
    "name": "Adductor SMR",
    "type": "stretching",
    "muscle": "adductors",
    "equipment": "foam_roll",
    "difficulty": "beginner",
    "instructions": "Lie face down with one leg on a foam roll. Rotate the leg so that the foam roll contacts against your inner thigh. Shift as much weight onto the foam roll as can be tolerated. While trying to relax the muscles if the inner thigh, roll over the foam between your hip and knee, holding points of tension for 10-30 seconds. Repeat with the other leg."
  },
  {
    "name": "Side Lying Groin Stretch",
    "type": "stretching",
    "muscle": "adductors",
    "equipment": "body_only",
    "difficulty": "intermediate",
    "instructions": "Start off by lying on your right side and bend your right knee in front of you to stabilize the torso. Rest your head on your right hand or shoulder. Lift your left leg upward and hold it by the back of the knee (easier) or the foot (harder). Pull your left knee in toward your left shoulder and simultaneously press your foot or knee down to the floor. To intensify this stretch, straighten your left leg. Switch sides."
  },
  {
    "name": "Adductor/Groin",
    "type": "stretching",
    "muscle": "adductors",
    "equipment": "none",
    "difficulty": "beginner",
    "instructions": "Lie on your back with your feet raised towards the ceiling. Have your partner hold your feet or ankles. Abduct your legs as far as you can. This will be your starting position. Attempt to squeeze your legs together for 10 or more seconds, while your partner prevents you from doing so. Now, relax the muscles in your legs as your partner pushes your feet apart, stretching as far as is comfortable for you. Be sure to let your partner know when the stretch is adequate to prevent overstretching or injury."
  },
  {
    "name": "Lying Bent Leg Groin",
    "type": "stretching",
    "muscle": "adductors",
    "equipment": "other",
    "difficulty": "beginner",
    "instructions": "Lie on your back with your knees bent and the soles of the feet pressed together. Have your partner hold your knees. This will be your starting position. Attempt to squeeze your knees together, while your partner prevents any movement from occurring. After 10-20 seconds, relax your muscles as your partner gently pushes your knees towards the floor. Be sure to inform your helper when the stretch is adequate to prevent injury or overstretching."
  },
  {
    "name": "Carioca quick step",
    "type": "plyometrics",
    "muscle": "adductors",
    "equipment": "body_only",
    "difficulty": "intermediate",
    "instructions": "The carioca quick step simulates coming out of the lateral power motion.  Begin with your feet a few inches apart and your left arm up in a relaxed, athletic position. With your right foot, quick step behind and pull the knee up. Fire your arms back up when you pull the right knee, being sure that your knee goes straight up and down. Avoid turning your feet as you move and continue to look forward as you move to the side."
  },
  {
    "name": "Lateral cone hop",
    "type": "plyometrics",
    "muscle": "adductors",
    "equipment": "body_only",
    "difficulty": "intermediate",
    "instructions": "Position a number of cones in a row several feet apart. Stand next to the end of the cones, facing 90 degrees to the direction of travel. This will be your starting position. Begin the jump by dipping with the knees to initiate a stretch reflex, and immediately reverse direction to push off the ground, jumping up and sideways over the cone. Use your legs to absorb impact upon landing, and rebound into the next jump, continuing down the row of cones."
  },
  {
    "name": "Lateral box jump",
    "type": "plyometrics",
    "muscle": "adductors",
    "equipment": "other",
    "difficulty": "intermediate",
    "instructions": "Assume a comfortable standing position, with a short box positioned next to you. This will be your starting position. Quickly dip into a quarter squat to initiate the stretch reflex, and immediately reverse direction to jump up and to the side. Bring your knees high enough to ensure your feet have good clearance over the box. Land on the center of the box, using your legs to absorb the impact. Carefully jump down to the other side of the box, and continue going back and forth for several repetitions."
  },
  {
    "name": "Side-To-Side Adductor Stretch",
    "type": "strength",
    "muscle": "adductors",
    "equipment": "body_only",
    "difficulty": "intermediate",
    "instructions": ""
  },
  {
    "name": "HM Left Leg Swing",
    "type": "strength",
    "muscle": "adductors",
    "equipment": "body_only",
    "difficulty": "intermediate",
    "instructions": ""
  },
  {
    "name": "UNS Foam Roll Adductor",
    "type": "strength",
    "muscle": "adductors",
    "equipment": "body_only",
    "difficulty": "intermediate",
    "instructions": ""
  },
  {
    "name": "Smith Machine Calf Raise",
    "type": "strength",
    "muscle": "calves",
    "equipment": "machine",
    "difficulty": "intermediate",
    "instructions": "Place a block or weight plate below the bar on the Smith machine. Set the bar to a position that best matches your height. Once the correct height is chosen and the bar is loaded, step onto the plates with the balls of your feet and place the bar on the back of your shoulders. Take the bar with both hands facing forward. Rotate the bar to unrack it. This will be your starting position. Raise your heels as high as possible by pushing off of the balls of your feet, flexing your calf at the top of the contraction. Your knees should remain extended. Hold the contracted position for a second before you start to go back down. Return slowly to the starting position as you breathe in while lowering your heels. Repeat for the recommended amount of repetitions."
  },
  {
    "name": "Standing Calf Raises",
    "type": "strength",
    "muscle": "calves",
    "equipment": "machine",
    "difficulty": "beginner",
    "instructions": "Adjust the padded lever of the calf raise machine to fit your height. Place your shoulders under the pads provided and position your toes facing forward (or using any of the two other positions described at the beginning of the chapter). The balls of your feet should be secured on top of the calf block with the heels extending off it. Push the lever up by extending your hips and knees until your torso is standing erect. The knees should be kept with a slight bend; never locked. Toes should be facing forward, outwards or inwards as described at the beginning of the chapter. This will be your starting position. Raise your heels as you breathe out by extending your ankles as high as possible and flexing your calf. Ensure that the knee is kept stationary at all times. There should be no bending at any time. Hold the contracted position by a second before you start to go back down. Go back slowly to the starting position as you breathe in by lowering your heels as you bend the ankles until calves are stretched. Repeat for the recommended amount of repetitions.  Caution: If you suffer from lower back problems, a better exercise is the calf press as during a standing calf raise the back has to support the weight being lifted. Also, maintain your back straight and stationary at all times. Rounding of the back can cause lower back injury. Variations: There are several other ways to perform a standing calf raise. A barbell instead of a machine can be used instead as well as dumbbells, one leg or two legs at a time. Refer to the exercise descriptions of these movements below. A smith machine can be used for calf raises as well."
  },
  {
    "name": "Seated Calf Raise",
    "type": "strength",
    "muscle": "calves",
    "equipment": "machine",
    "difficulty": "intermediate",
    "instructions": "Sit on the machine and place your toes on the lower portion of the platform provided with the heels extending off. Choose the toe positioning of your choice (forward, in, or out) as per the beginning of this chapter. Place your lower thighs under the lever pad, which will need to be adjusted according to the height of your thighs. Now place your hands on top of the lever pad in order to prevent it from slipping forward. Lift the lever slightly by pushing your heels up and release the safety bar. This will be your starting position. Slowly lower your heels by bending at the ankles until the calves are fully stretched. Inhale as you perform this movement. Raise the heels by extending the ankles as high as possible as you contract the calves and breathe out. Hold the top contraction for a second. Repeat for the recommended amount of repetitions."
  },
  {
    "name": "Calf Press On The Leg Press Machine",
    "type": "strength",
    "muscle": "calves",
    "equipment": "machine",
    "difficulty": "intermediate",
    "instructions": "Using a leg press machine, sit down on the machine and place your legs on the platform directly in front of you at a medium (shoulder width) foot stance. Lower the safety bars holding the weighted platform in place and press the platform all the way up until your legs are fully extended in front of you without locking your knees. (Note: In some leg press units you can leave the safety bars on for increased safety. If your leg press unit allows for this, then this is the preferred method of performing the exercise.) Your torso and the legs should make perfect 90-degree angle. Now carefully place your toes and balls of your feet on the lower portion of the platform with the heels extending off. Toes should be facing forward, outwards or inwards as described at the beginning of the chapter. This will be your starting position. Press on the platform by raising your heels as you breathe out by extending your ankles as high as possible and flexing your calf. Ensure that the knee is kept stationary at all times. There should be no bending at any time. Hold the contracted position by a second before you start to go back down. Go back slowly to the starting position as you breathe in by lowering your heels as you bend the ankles until calves are stretched. Repeat for the recommended amount of repetitions.  Caution: Be very cautious as you place the feet in the bottom part of the platform as if you slip and the safety bars are not locked then you could suffer a serious accident. Variations: You can perform this exercise one leg at a time."
  },
  {
    "name": "Rocking Standing Calf Raise",
    "type": "strength",
    "muscle": "calves",
    "equipment": "barbell",
    "difficulty": "beginner",
    "instructions": "This exercise is best performed inside a squat rack for safety purposes. To begin, first set the bar on a rack that best matches your height. Once the correct height is chosen and the bar is loaded, step under the bar and place it on the back of your shoulders (slightly below the neck). Hold on to the bar using both arms at each side and lift it off the rack by first pushing with your legs and at the same time straightening your torso. Step away from the rack and position your legs using a shoulder width medium stance with the toes slightly pointed out. Keep your head up at all times as looking down will get you off balance. Also maintain a straight back and keep the knees with a slight bend; never locked. This will be your starting position. Raise your heels as you breathe out by extending your ankles as high as possible and flexing your calf. Ensure that the knee is kept stationary at all times. There should be no bending (other than the slight initial bend we created during positioning) at any time. Hold the contracted position by a second before you start to go back down. Go back slowly to the starting position as you breathe in by lowering your heels as you bend the ankles until calves are stretched. Now lift your toes by contracting the tibia muscles in the front of the calves as you breathe out. Hold for a second and bring them back down as you breathe in. Repeat for the recommended amount of repetitions.  Caution: Maintain your back straight and stationary at all times. Rounding of the back can cause lower back injury. Also, choose a conservative weight. This exercise requires a lot of balance and choosing too much weight may cause you to lose balance and fall. Variations: A smith machine can be used for this exercise as well and it is a better choice for those with poor balance. Dumbbells can be used also."
  },
  {
    "name": "Calf Press",
    "type": "strength",
    "muscle": "calves",
    "equipment": "machine",
    "difficulty": "beginner",
    "instructions": "Adjust the seat so that your legs are only slightly bent in the start position. The balls of your feet should be firmly on the platform. Select an appropriate weight, and grasp the handles. This will be your starting position. Straighten the legs by extending the knees, just barely lifting the weight from the stack. Your ankle should be fully flexed, toes pointing up. Execute the movement by pressing downward through the balls of your feet as far as possible. After a brief pause, reverse the motion and repeat."
  },
  {
    "name": "Standing barbell calf raise",
    "type": "strength",
    "muscle": "calves",
    "equipment": "barbell",
    "difficulty": "beginner",
    "instructions": "This exercise is best performed inside a squat rack for safety purposes. To begin, first set the bar on a rack that best matches your height. Once the correct height is chosen and the bar is loaded, step under the bar and place the bar on the back of your shoulders (slightly below the neck). Hold on to the bar using both arms at each side and lift it off the rack by first pushing with your legs and at the same time straightening your torso. Step away from the rack and position your legs using a shoulder width medium stance with the toes slightly pointed out. Keep your head up at all times as looking down will get you off balance and also maintain a straight back. The knees should be kept with a slight bend; never locked. This will be your starting position. Tip: For better range of motion you may also place the ball of your feet on a wooden block but be careful as this option requires more balance and a sturdy block. Raise your heels as you breathe out by extending your ankles as high as possible and flexing your calf. Ensure that the knee is kept stationary at all times. There should be no bending at any time. Hold the contracted position by a second before you start to go back down. Go back slowly to the starting position as you breathe in by lowering your heels as you bend the ankles until calves are stretched. Repeat for the recommended amount of repetitions.  Caution: If you suffer from lower back problems, a better exercise is the calf press as during a standing calf raise the back has to support the weight being lifted. Also, maintain your back straight and stationary at all times. Rounding of the back can cause lower back injury. Variations: There are several other ways to perform a standing calf raise. A calf press machine instead of a squat rack can be used as well as dumbbells with one leg or two legs at a time. A smith machine can be used for calf raises as well. You can also perform the barbell calf raise using a piece of wood to place the ball of the foot. This will allow you to get a better range of motion. However be cautious as in this case you will need to balance yourself much better."
  },
  {
    "name": "Barbell Seated Calf Raise",
    "type": "strength",
    "muscle": "calves",
    "equipment": "barbell",
    "difficulty": "beginner",
    "instructions": "Place a block about 12 inches in front of a flat bench. Sit on the bench and place the ball of your feet on the block. Have someone place a barbell over your upper thighs about 3 inches above your knees and hold it there. This will be your starting position. Raise up on your toes as high as possible as you squeeze the calves and as you breathe out. After a second contraction, slowly go back to the starting position. Tip: To get maximum benefit stretch your calves as far as you can. Repeat for the recommended amount of repetitions.  Variations: You can use the smith machine or the seated calf raise machine in order to perform this exercise. Alternatively, you can also use dumbbells by placing one on top of each thigh."
  },
  {
    "name": "Balance Board",
    "type": "strength",
    "muscle": "calves",
    "equipment": "other",
    "difficulty": "beginner",
    "instructions": "Note: This exercise is designed to increase balance.  Place a balance board in front of you. Stand up on it and try to balance yourself. Hold the balance for as long as desired.  Caution: If your balance is poor, start out with one of the less challenging boards. Variations: You can perform this exercise using various types of balance boards. Some are more challenging than others."
  },
  {
    "name": "Weighted donkey calf raise",
    "type": "strength",
    "muscle": "calves",
    "equipment": "other",
    "difficulty": "intermediate",
    "instructions": "For this exercise you will need access to a donkey calf raise machine. Start by positioning your lower back and hips under the padded lever provided. The tailbone area should be the one making contact with the pad. Place both of your arms on the side handles and place the balls of your feet on the calf block with the heels extending off. Align the toes forward, inward or outward, depending on the area you wish to target, and straighten the knees without locking them. This will be your starting position. Raise your heels as you breathe out by extending your ankles as high as possible and flexing your calf. Ensure that the knee is kept stationary at all times. There should be no bending at any time. Hold the contracted position by a second before you start to go back down. Go back slowly to the starting position as you breathe in by lowering your heels as you bend the ankles until calves are stretched. Repeat for the recommended amount of repetitions.  Variations: If you don't have a machine available but have access to a calf block and a sturdy object to hold on to, you can perform this using as resistance a person sitting on your lower back (around the tailbone area)."
  },
  {
    "name": "Smith Machine Reverse Calf Raises",
    "type": "strength",
    "muscle": "calves",
    "equipment": "machine",
    "difficulty": "beginner",
    "instructions": "Adjust the barbell on the smith machine to fit your height and align a raised platform right under the bar. Stand on the platform with the heels of your feet secured on top of it with the balls of your feet extending off it. Position your toes facing forward with a shoulder width stance. Now, place your shoulders under the barbell while maintaining the foot positioning described and push the barbell up by extending your hips and knees until your torso is standing erect. The knees should be kept with a slight bend; never locked. This will be your starting position. Tip: The barbell on your back is only for balance purposes. Raise the balls of your feet as you breathe out by extending your toes as high as possible and flexing your calf. Ensure that the knee is kept stationary at all times. There should be no bending at any time. Hold the contracted position for a second before you start to go back down. Slowly go back down to the starting position as you breathe in by lowering the balls of your feet and toes. Repeat for the recommended amount of repetitions.  Variations: You can also have someone place a dumbbell in between your feet for resistance. You can also perform this exercise using a doorstep and you can use the sides of the door frame for balance. If you change the position of the platform by putting it forward or backwards, it will emphasize the higher or lower calf. Similarly, the stance you use can affect where it hits; the closer your feet are, the more the sides will be isolated, whereas the further apart your feet are, the more the front tibialis will be targeted."
  },
  {
    "name": "Dumbbell Seated One-Leg Calf Raise",
    "type": "strength",
    "muscle": "calves",
    "equipment": "dumbbell",
    "difficulty": "beginner",
    "instructions": "Place a block on the floor about 12 inches from a flat bench. Sit on a flat bench and place a dumbbell on your upper left thigh about 3 inches above your knee. Now place the ball of your left foot on the block. This will be your starting position. Raise your toes up as high as possible as you exhale and you contract your calf muscle. Hold the contraction for a second. Slowly return to the starting position, stretching as far down as possible. Repeat for your prescribed number of repetitions and then repeat with the right leg.  Variations: You can perform this exercise also with both legs at the same time as well as using a seated calf raise machine."
  },
  {
    "name": "Ankle Circles",
    "type": "stretching",
    "muscle": "calves",
    "equipment": "none",
    "difficulty": "beginner",
    "instructions": "Use a sturdy object like a squat rack to hold yourself. Lift the right leg in the air (just around 2 inches from the floor) and perform a circular motion with the big toe. Pretend that you are drawing a big circle with it. Tip: One circle equals 1 repetition. Breathe normally as you perform the movement. When you are done with the right foot, then repeat with the left leg.  Variations: None"
  },
  {
    "name": "Peroneals-SMR",
    "type": "stretching",
    "muscle": "calves",
    "equipment": "body_only",
    "difficulty": "intermediate",
    "instructions": "Lay on your side, supporting your weight on your forearm and on a foam roller placed on the outside of your lower leg. Your upper leg can either be on top of your lower leg, or you can cross it in front of you. This will be your starting position. Raise your hips off of the ground and begin to roll from below the knee to above the ankle on the side of your leg, pausing at points of tension for 10-30 seconds. Repeat on the other leg."
  },
  {
    "name": "Knee Circles",
    "type": "stretching",
    "muscle": "calves",
    "equipment": "body_only",
    "difficulty": "beginner",
    "instructions": "Stand with your legs together and hands by your waist. Now move your knees in a circular motion as you breathe normally. Repeat for the recommended amount of repetitions."
  },
  {
    "name": "Calf SMR",
    "type": "stretching",
    "muscle": "calves",
    "equipment": "foam_roll",
    "difficulty": "beginner",
    "instructions": "Begin seated on the floor. Place a foam roller underneath your lower leg. Your other leg can either be crossed over the opposite or be placed on the floor, supporting some of your weight. This will be your starting position. Place your hands to your side or just behind you, and press down to raise your hips off of the floor, placing much of your weight against your calf muscle. Roll from below the knee to above the ankle, pausing at points of tension for 10-30 seconds. Repeat for the other leg."
  },
  {
    "name": "Standing Gastrocnemius Calf Stretch",
    "type": "stretching",
    "muscle": "calves",
    "equipment": "body_only",
    "difficulty": "intermediate",
    "instructions": "Place your right heel on a step with your knee extended and lean forward to grab your right toe with your right hand. Your left knee should be slightly bent and your back should be straight. Support your weight on your left leg and place your left hand on your left thigh. Pull your right toes toward your knee until you feel a stretch in your calf."
  },
  {
    "name": "Wall calf stretch",
    "type": "stretching",
    "muscle": "calves",
    "equipment": "body_only",
    "difficulty": "intermediate",
    "instructions": "Stand facing a wall from several feet away. Stagger your stance, placing one foot forward. Lean forward and rest your hands on the wall, keeping your heel, hip and head in a straight line. Attempt to keep your heel on the ground. Hold for 10-20 seconds and then switch sides."
  },
  {
    "name": "Anterior Tibialis-SMR",
    "type": "stretching",
    "muscle": "calves",
    "equipment": "other",
    "difficulty": "beginner",
    "instructions": "Begin seated on the ground with your legs bent and your feet on the floor. Using a Muscle Roller or a rolling pin, apply pressure to the muscles on the outside of your shins. Work from just below the knee to above the ankle, pausing at points of tension for 10-30 seconds. Repeat on the other leg."
  },
  {
    "name": "Barbell glute bridge",
    "type": "powerlifting",
    "muscle": "glutes",
    "equipment": "barbell",
    "difficulty": "intermediate",
    "instructions": "Begin seated on the ground with a loaded barbell over your legs. Using a fat bar or having a pad on the bar can greatly reduce the discomfort caused by this exercise. Roll the bar so that it is directly above your hips, and lay down flat on the floor. Begin the movement by driving through with your heels, extending your hips vertically through the bar. Your weight should be supported by your upper back and the heels of your feet. Extend as far as possible, then reverse the motion to return to the starting position."
  },
  {
    "name": "Barbell Hip Thrust",
    "type": "powerlifting",
    "muscle": "glutes",
    "equipment": "barbell",
    "difficulty": "intermediate",
    "instructions": "Begin seated on the ground with a bench directly behind you. Have a loaded barbell over your legs. Using a fat bar or having a pad on the bar can greatly reduce the discomfort caused by this exercise. Roll the bar so that it is directly above your hips, and lean back against the bench so that your shoulder blades are near the top of it. Begin the movement by driving through your feet, extending your hips vertically through the bar. Your weight should be supported by your shoulder blades and your feet. Extend as far as possible, then reverse the motion to return to the starting position."
  },
  {
    "name": "Single-leg cable hip extension",
    "type": "strength",
    "muscle": "glutes",
    "equipment": "cable",
    "difficulty": "intermediate",
    "instructions": "Hook a leather ankle cuff to a low cable pulley and then attach the cuff to your ankle. Face the weight stack from a distance of about two feet, grasping the steel frame for support. While keeping your knees and hips bent slightly and your abs tight, contract your glutes to slowly \"kick\" the working leg back in a semicircular arc as high as it will comfortably go as you breathe out. Tip: At full extension, squeeze your glutes for a second in order to achieve a peak contraction. Now slowly bring your working leg forward, resisting the pull of the cable until you reach the starting position. Repeat for the recommended amount of repetitions. Switch legs and repeat the movement for the other side.  Variations: You can perform this exercise with exercise bands."
  },
  {
    "name": "Glute bridge",
    "type": "strength",
    "muscle": "glutes",
    "equipment": "body_only",
    "difficulty": "intermediate",
    "instructions": "Lie flat on the floor on your back with the hands by your side and your knees bent. Your feet should be placed around shoulder width. This will be your starting position. Pushing mainly with your heels, lift your hips off the floor while keeping your back straight. Breathe out as you perform this part of the motion and hold at the top for a second. Slowly go back to the starting position as you breathe in.  Variations: You can perform this exercise one leg at a time."
  },
  {
    "name": "Single-leg glute bridge",
    "type": "strength",
    "muscle": "glutes",
    "equipment": "body_only",
    "difficulty": "intermediate",
    "instructions": "Lay on the floor with your feet flat and knees bent. Raise one leg off of the ground, pulling the knee to your chest. This will be your starting position. Execute the movement by driving through the heel, extending your hip upward and raising your glutes off of the ground. Extend as far as possible, pause and then return to the starting position."
  },
  {
    "name": "Step-up with knee raise",
    "type": "strength",
    "muscle": "glutes",
    "equipment": "body_only",
    "difficulty": "intermediate",
    "instructions": "Stand facing a box or bench of an appropriate height with your feet together. This will be your starting position. Begin the movement by stepping up, putting your left foot on the top of the bench. Extend through the hip and knee of your front leg to stand up on the box. As you stand on the box with your left leg, flex your right knee and hip, bringing your knee as high as you can. Reverse this motion to step down off the box, and then repeat the sequence on the opposite leg."
  },
  {
    "name": "Kettlebell thruster",
    "type": "strength",
    "muscle": "glutes",
    "equipment": "kettlebells",
    "difficulty": "intermediate",
    "instructions": "Clean two kettlebells to your shoulders. Clean the kettlebells to your shoulders by extending through the legs and hips as you pull the kettlebells towards your shoulders. Rotate your wrists as you do so. This will be your starting position. Begin to squat by flexing your hips and knees, lowering your hips between your legs. Maintain an upright, straight back as you descend as low as you can. At the bottom, reverse direction and squat by extending your knees and hips, driving through your heels. As you do so, press both kettlebells overhead by extending your arms straight up, using the momentum from the squat to help drive the weights upward. As you begin the next repetition, return the weights to the shoulders."
  },
  {
    "name": "Kneeling Squat",
    "type": "powerlifting",
    "muscle": "glutes",
    "equipment": "barbell",
    "difficulty": "beginner",
    "instructions": "Set the bar to the proper height in a power rack. Kneel behind the bar; it may be beneficial to put a mat down to pad your knees. Slide under the bar, racking it across the back of your shoulders. Your shoulder blades should be retracted and the bar tight across your back. Unrack the weight. With your head looking forward, sit back with your butt until you touch your calves. Reverse the motion, returning the torso to an upright position."
  },
  {
    "name": "Flutter Kicks",
    "type": "strength",
    "muscle": "glutes",
    "equipment": "None",
    "difficulty": "intermediate",
    "instructions": "On a flat bench lie facedown with the hips on the edge of the bench, the legs straight with toes high off the floor and with the arms on top of the bench holding on to the front edge. Squeeze your glutes and hamstrings and straighten the legs until they are level with the hips. This will be your starting position. Start the movement by lifting the left leg higher than the right leg. Then lower the left leg as you lift the right leg. Continue alternating in this manner (as though you are doing a flutter kick in water) until you have done the recommended amount of repetitions for each leg. Make sure that you keep a controlled movement at all times. Tip: You will breathe normally as you perform this movement.  Variations: As you get more advanced you can use ankle weights."
  },
  {
    "name": "Glute Kickback",
    "type": "strength",
    "muscle": "glutes",
    "equipment": "body_only",
    "difficulty": "beginner",
    "instructions": "Kneel on the floor or an exercise mat and bend at the waist with your arms extended in front of you (perpendicular to the torso) in order to get into a kneeling push-up position but with the arms spaced at shoulder width. Your head should be looking forward and the bend of the knees should create a 90-degree angle between the hamstrings and the calves. This will be your starting position. As you exhale, lift up your right leg until the hamstrings are in line with the back while maintaining the 90-degree angle bend. Contract the glutes throughout this movement and hold the contraction at the top for a second. Tip: At the end of the movement the upper leg should be parallel to the floor while the calf should be perpendicular to it. Go back to the initial position as you inhale and now repeat with the left leg. Continue to alternate legs until all of the recommended repetitions have been performed.  Variations: For this exercise you can also perform all of the repetitions with one leg first and then the other one. Additionally, you can also add ankle weights."
  },
  {
    "name": "Exercise ball hip thrust",
    "type": "strength",
    "muscle": "glutes",
    "equipment": "exercise_ball",
    "difficulty": "intermediate",
    "instructions": "Lay on a ball so that your upper back is on the ball with your hips unsupported. Both feet should be flat on the floor, hip width apart or wider. This will be your starting position. Begin by extending the hips using your glutes and hamstrings, raising your hips upward as you bridge. Pause at the top of the motion and return to the starting position."
  },
  {
    "name": "Kneeling Jump Squat",
    "type": "olympic_weightlifting",
    "muscle": "glutes",
    "equipment": "barbell",
    "difficulty": "beginner",
    "instructions": "Begin kneeling on the floor with a barbell racked across the back of your shoulders, or you can use your body weight for this exercise. This can be done inside of a power rack to make unracking easier. Sit back with your hips until your glutes touch your feet, keeping your head and chest up. Explode up with your hips, generating enough power to land with your feet flat on the floor. Continue with the squat by driving through your heels and extending the knees to come to a standing position."
  },
  {
    "name": "Pull Through",
    "type": "strength",
    "muscle": "glutes",
    "equipment": "cable",
    "difficulty": "beginner",
    "instructions": "Begin standing a few feet in front of a low pulley with a rope or handle attached. Face away from the machine, straddling the cable, with your feet set wide apart. Begin the movement by reaching through your legs as far as possible, bending at the hips. Keep your knees slightly bent. Keeping your arms straight, extend through the hip to stand straight up. Avoid pulling upward through the shoulders; all of the motion should originate through the hips."
  },
  {
    "name": "Hip Extension with Bands",
    "type": "strength",
    "muscle": "glutes",
    "equipment": "bands",
    "difficulty": "beginner",
    "instructions": "Secure one end of the band to the lower portion of a post and attach the other to one ankle. Facing the attachment point of the band, hold on to the column to stabilize yourself. Keeping your head and your chest up, move the resisted leg back as far as you can while keeping the knee straight. Return the leg to the starting position."
  },
  {
    "name": "Piriformis SMR",
    "type": "stretching",
    "muscle": "glutes",
    "equipment": "foam_roll",
    "difficulty": "intermediate",
    "instructions": "Sit with your buttocks on top of a foam roll. Bend your knees, and then cross one leg so that the ankle is over the knee. This will be your starting position. Shift your weight to the side of the crossed leg, rolling over the buttocks until you feel tension in your upper glute. You may assist the stretch by using one hand to pull the bent knee towards your chest. Hold this position for 10-30 seconds, and then switch sides."
  },
  {
    "name": "Standing hip extension",
    "type": "strength",
    "muscle": "glutes",
    "equipment": "body_only",
    "difficulty": "beginner",
    "instructions": "While standing up straight with both feet next to each other at around shoulder width, grab a sturdy surface such as the sides of a squat rack or the top of a chair to brace yourself and keep balance. With or without an ankle weight, lift one leg behind you as if performing a leg curl but standing up while keeping the other leg straight. Breathe out as you perform this movement. Slowly bring the raised leg back to the floor as you breathe in. Repeat for the recommended amount of repetitions. Repeat the movement with the opposite leg.  Variations: You can perform the same movement with a low pulley attached to your ankle using an ankle attachment. Optionally, you can use exercise cables as well."
  },
  {
    "name": "Hip Lift with Band",
    "type": "powerlifting",
    "muscle": "glutes",
    "equipment": "bands",
    "difficulty": "beginner",
    "instructions": "After choosing a suitable band, lay down in the middle of the rack, after securing the band on either side of you. If your rack doesn't have pegs, the band can be secured using heavy dumbbells or similar objects, just ensure they won't move. Adjust your position so that the band is directly over your hips. Bend your knees and place your feet flat on the floor. Your hands can be on the floor or holding the band in position. Keeping your shoulders on the ground, drive through your heels to raise your hips, pushing into the band as high as you can. Pause at the top of the motion, and return to the starting position."
  },
  {
    "name": "Lying glute stretch",
    "type": "stretching",
    "muscle": "glutes",
    "equipment": "body_only",
    "difficulty": "intermediate",
    "instructions": "From a lying position, bend your knees and keep your feet on the floor. Place your ankle of one foot on your opposite knee. Grasp the thigh or knee of the bottom leg and pull both of your legs into the chest. Relax your neck and shoulders. Hold for 10-20 seconds and then switch sides."
  },
  {
    "name": "Downward Facing Balance",
    "type": "strength",
    "muscle": "glutes",
    "equipment": "exercise_ball",
    "difficulty": "beginner",
    "instructions": "Lie facedown on top of an exercise ball. While resting on your stomach on the ball, walk your hands forward along the floor and lift your legs, extending your elbows and knees."
  },
  {
    "name": "Barbell Deadlift",
    "type": "strength",
    "muscle": "hamstrings",
    "equipment": "barbell",
    "difficulty": "intermediate",
    "instructions": "Approach the bar so that it is centered over your feet. Your feet should be about hip-width apart. Bend at the hip to grip the bar at shoulder-width allowing your shoulder blades to protract. Typically, you would use an alternating grip. With your feet and your grip set, take a big breath and then lower your hips and flex the knees until your shins contact the bar. Look forward with your head. Keep your chest up and your back arched, and begin driving through the heels to move the weight upward. After the bar passes the knees aggressively pull the bar back, pulling your shoulder blades together as you drive your hips forward into the bar. Lower the bar by bending at the hips and guiding it to the floor."
  },
  {
    "name": "Romanian Deadlift With Dumbbells",
    "type": "strength",
    "muscle": "hamstrings",
    "equipment": "dumbbell",
    "difficulty": "beginner",
    "instructions": "Begin in a standing position with a dumbbell in each hand. Ensure that your back is straight and stays that way for the duration of the exercise. Allow your arms to hang perpendicular to the floor, with the wrists pronated and the elbows pointed to your sides. This will be your starting position. Initiate the movement by flexing your hips, slowly pushing your butt as far back as you can. This should entail a horizontal movement of the hips, rather than a downward movement. The knees should only partially bend, and your weight should remain on your heels. Drive your butt back as far as you can, which should generate tension in your hamstrings as your hands approach knee level. Maintain an arch in your back throughout the exercise. When your hips cannot perform any further backward movement, pause, and then slowly return to the starting position by extending the hips."
  },
  {
    "name": "Clean Deadlift",
    "type": "olympic_weightlifting",
    "muscle": "hamstrings",
    "equipment": "barbell",
    "difficulty": "beginner",
    "instructions": "Begin standing with a barbell close to your shins. Your feet should be directly under your hips with your feet turned out slightly. Grip the bar with a double overhand grip or hook grip, about shoulder width apart. Squat down to the bar. Your spine should be in full extension, with a back angle that places your shoulders in front of the bar and your back as vertical as possible. Begin by driving through the floor through the front of your heels. As the bar travels upward, maintain a constant back angle. Flare your knees out to the side to help keep them out of the bar's path. After the bar crosses the knees, complete the lift by driving the hips into the bar until your hips and knees are extended."
  },
  {
    "name": "Sumo deadlift",
    "type": "powerlifting",
    "muscle": "hamstrings",
    "equipment": "barbell",
    "difficulty": "beginner",
    "instructions": "Begin with a bar loaded on the ground. Approach the bar so that the bar intersects the middle of the feet. The feet should be set very wide, near the collars. Bend at the hips to grip the bar. The arms should be directly below the shoulders, inside the legs, and you can use a pronated grip, a mixed grip, or hook grip. Relax the shoulders, which in effect lengthens your arms. Take a breath, and then lower your hips, looking forward with your head with your chest up. Drive through the floor, spreading your feet apart, with your weight on the back half of your feet. Extend through the hips and knees. As the bar passes through the knees, lean back and drive the hips into the bar, pulling your shoulder blades together. Return the weight to the ground by bending at the hips and controlling the weight on the way down."
  },
  {
    "name": "Romanian Deadlift from Deficit",
    "type": "olympic_weightlifting",
    "muscle": "hamstrings",
    "equipment": "barbell",
    "difficulty": "beginner",
    "instructions": "Begin standing while holding a bar at arms length in front of you. You can stand on a raised platform to increase the range of motion. Begin by flexing the knees slightly, and then flex at the hip, moving your butt back as far as possible, lowering the torso as far as flexibility allows. The back should remain in absolute extension at all times, and the bar should remain in contact with the legs. If done properly, there should be heavy tension felt in the hamstrings. Reverse the motion to return to the starting position."
  },
  {
    "name": "Power Snatch",
    "type": "olympic_weightlifting",
    "muscle": "hamstrings",
    "equipment": "barbell",
    "difficulty": "beginner",
    "instructions": "Begin with a loaded barbell on the floor. The bar should be close to or touching the shins, and a wide grip should be taken on the bar. The feet should be directly below the hips, with the feet turned out as needed. Lower the hips, with the chest up and the head looking forward. The shoulders should be just in front of the bar. This will be the starting position. Begin the first pull by driving through the front of the heels, raising the bar from the ground. The back angle should stay the same until the bar passes the knees. Transition into the second pull by extending through the hips knees and ankles, driving the bar up as quickly as possible. The bar should be close to the body. At peak extension, shrug the shoulders and allow the elbows to flex to the side. As you move your feet into the receiving position, a slightly wider position, pull yourself below the bar as you elevate the bar overhead. The bar should be received in a partial squat. Continue raising the bar to the overhead position, receiving the bar locked out overhead. Return to a standing position with the weight over head."
  },
  {
    "name": "Power Clean from Blocks",
    "type": "olympic_weightlifting",
    "muscle": "hamstrings",
    "equipment": "barbell",
    "difficulty": "beginner",
    "instructions": "With a barbell on boxes of the desired height, take a grip just outside the legs. Lower your hips with the weight focused on the heels, back straight, head facing forward, chest up, with your shoulders just in front of the bar. This will be your starting position. Begin the first pull by driving through the heels, extending your knees. Your back angle should stay the same, and your arms should remain straight. As the bar approaches the mid-thigh position, begin extending through the hips. In a jumping motion, accelerate by extending the hips, knees, and ankles, using speed to move the bar upward. There should be no need to actively pull through the arms to accelerate the weight. At the end of the second pull, the body should be fully extended, leaning slightly back, with the arms still extended. As full extension is achieved, transition into the third pull by aggressively shrugging and flexing the arms with the elbows up and out. At peak extension, pull yourself under the bar far enough that it can be racked onto the shoulders, rotating your elbows under the bar as you do so. The bar should be racked onto the protracted shoulders, lightly touching the throat with the hands relaxed. Immediately recover by driving through the heels, keeping the torso upright and elbows up. Continue until you have risen to a standing position, and complete the repetition by returning the weight to the boxes."
  },
  {
    "name": "Natural Glute Ham Raise",
    "type": "strength",
    "muscle": "hamstrings",
    "equipment": "body_only",
    "difficulty": "beginner",
    "instructions": "Using the leg pad of a lat pulldown machine or a preacher bench, position yourself so that your ankles are under the pads, knees on the seat, and you are facing away from the machine. You should be upright and maintaining good posture. This will be your starting position. Lower yourself under control until your knees are almost completely straight. Remaining in control, raise yourself back up to the starting position. If you are unable to complete a rep, use a band, a partner, or push off of a box to aid in completing a repetition."
  },
  {
    "name": "Glute ham raise-",
    "type": "strength",
    "muscle": "hamstrings",
    "equipment": "none",
    "difficulty": "beginner",
    "instructions": "You can use a partner for this exercise or brace your feet under something stable. Begin on your knees with your upper legs and torso upright. If using a partner, they will firmly hold your feet to keep you in position. This will be your starting position. Lower yourself by extending at the knee, taking care to NOT flex the hips as you go forward. Place your hands in front of you as you reach the floor. This movement is very difficult and you may be unable to do it unaided. Use your arms to lightly push off the floor to aid your return to the starting position."
  },
  {
    "name": "Snatch Deadlift",
    "type": "olympic_weightlifting",
    "muscle": "hamstrings",
    "equipment": "barbell",
    "difficulty": "beginner",
    "instructions": "The snatch deadlift strengthens the first pull of the snatch. Begin with a wide snatch grip with the barbell placed on the platform. The feet should be directly under the hips, with the feet turned out. Squat down to the bar, keeping the back in absolute extension with the head facing forward. Initiate the movement by driving through the heels, raising the hips. The back angle should remain the same until the bar passes the knees. At that point, drive your hips through the bar as you lay back. Return the bar to the platform by reversing the motion."
  },
  {
    "name": "Lying Leg Curls",
    "type": "strength",
    "muscle": "hamstrings",
    "equipment": "machine",
    "difficulty": "beginner",
    "instructions": "Adjust the machine lever to fit your height and lie face down on the leg curl machine with the pad of the lever on the back of your legs (just a few inches under the calves). Tip: Preferably use a leg curl machine that is angled as opposed to flat since an angled position is more favorable for hamstrings recruitment. Keeping the torso flat on the bench, ensure your legs are fully stretched and grab the side handles of the machine. Position your toes straight (or you can also use any of the other two stances described on the foot positioning section). This will be your starting position. As you exhale, curl your legs up as far as possible without lifting the upper legs from the pad. Once you hit the fully contracted position, hold it for a second. As you inhale, bring the legs back to the initial position. Repeat for the recommended amount of repetitions.  Caution: Do not ever use so much weight on the exercise that you start using swinging and jerking as you can risk both lower back injury and also a hamstring injury. Variations: Since you have three foot positions you have in reality three exercises. The movement can also be performed with a dumbbell held in between your feet (a partner needs to place it properly). This latter exercise though is only suitable for advanced trainees. Finally, it is also possible to just use one leg at a time for better isolation."
  },
  {
    "name": "Stiff-Legged Dumbbell Deadlift",
    "type": "strength",
    "muscle": "hamstrings",
    "equipment": "dumbbell",
    "difficulty": "intermediate",
    "instructions": "Grasp a couple of dumbbells holding them by your side at arm's length. Stand with your torso straight and your legs spaced using a shoulder width or narrower stance. The knees should be slightly bent. This is your starting position. Keeping the knees stationary, lower the dumbbells to over the top of your feet by bending at the waist while keeping your back straight. Keep moving forward as if you were going to pick something from the floor until you feel a stretch on the hamstrings. Exhale as you perform this movement Start bringing your torso up straight again by extending your hips and waist until you are back at the starting position. Inhale as you perform this movement. Repeat for the recommended amount of repetitions.  Caution: This is not an exercise that is recommended for people with lower back problems. Also, it needs to be treated with the utmost respect paying special attention not to round the back forward as you move the torso down; the back should always be straight. Finally, jerking motions or doing too much weight can injure your back. Variations: The exercise can also be performed with a barbell also."
  },
  {
    "name": "Exercise ball leg curl",
    "type": "strength",
    "muscle": "hamstrings",
    "equipment": "exercise_ball",
    "difficulty": "intermediate",
    "instructions": "Begin on the floor laying on your back with your feet on top of the ball. Position the ball so that when your legs are extended your ankles are on top of the ball. This will be your starting position. Raise your hips off of the ground, keeping your weight on the shoulder blades and your feet. Flex the knees, pulling the ball as close to you as you can, contracting the hamstrings. After a brief pause, return to the starting position."
  },
  {
    "name": "Kettlebell pass-through lunge",
    "type": "strength",
    "muscle": "hamstrings",
    "equipment": "kettlebells",
    "difficulty": "intermediate",
    "instructions": "Stand with your torso upright holding a kettlebell in your right hand. This will be your starting position. Step forward with your left foot and lower your upper body down by flexing the hip and the knee, keeping the torso upright. Lower your back knee until it nearly touches the ground. As you lunge, pass the kettlebell under your front leg to your opposite hand. Pressing through the heel of your foot, return to the starting position. Repeat the movement for the recommended amount of repetitions, alternating legs."
  },
  {
    "name": "Power clean",
    "type": "strength",
    "muscle": "hamstrings",
    "equipment": "barbell",
    "difficulty": "intermediate",
    "instructions": "Note: This exercise is extremely complex and requires the execution of many phases. Phase 1: Starting Position  Stand with your feet slightly wider than shoulder width apart and toes pointing out slightly. Squat down and grasp bar with a closed, pronated grip. Your hands should be slightly wider than shoulder width apart outside knees with elbows fully extended. Place the bar about 1 inch in front of your shins and over the balls of your feet. Your back should be flat or slightly arched, your chest held up and out and your shoulder blades should be retracted. Keep your head in a neutral position (in line with vertebral column and not tilted or rotated) with your eyes focused straight ahead. Inhale during this phase.  Phase 2: First Pull Phase  Lift the bar from the floor by forcefully extending the hips and the knees as you exhale. Tip: The upper torso should maintain the same angle. Do not bend at the waist yet and do not let the hips rise before the shoulders (this would have the effect of pushing the glutes in the air and stretching the hamstrings. Keep elbows fully extended with the head in a neutral position and the shoulders over the bar. As the bar raises keep it as close to the shins as possible.  Phase 3: Transition or Scoop Phase  As the bar passes the knees, thrust your hips forward and slightly bend the knees to avoid locking them. Tip: At this point your thighs should be against the bar. Keep the back flat or slightly arched, elbows fully extended and your head neutral. Tip: You will hold your breath until the next phase.  Phase 4: Second Pull Phase  Inhale and then forcefully and quickly extend your hips and knees and stand on your toes. Keep the bar as close to your body as possible. Tip: Your back should be flat with the elbows pointed out to the sides and your head in a neutral position. Also, keep your shoulders over the bar and arms straight as long as possible. When your lower body joints are fully extended, shrug the shoulders upward rapidly without letting the elbows flex yet. Exhale during this portion of the movement. As the shoulders reach their highest elevation flex your elbows to begin pulling your body under the bar. Continue to pull the arms as high and as long as possible. Tip: Due to the explosive nature of this phase, your torso will be erect or with an arched back, your head will be tilted back slightly and your feet may lose contact with the floor.  Phase 5: Catch Phase  After the lower body has fully extended and the bar reaches near maximal height, pull your body under the bar and rotate the arms around and under the bar. Simultaneously, flex the hips and knees into a quarter squat position. Once the arms are under the bar, inhale and then lift your elbows to position the upper arms parallel to the floor. Rack the bar across the front of your collar bones and front shoulder muscles. Catch the bar with an erect and tight torso, a neutral head position and flat feet. Exhale during this movement. Stand up by extending the hips and knees to a fully erect position.  Phase 6: Downward Movement Phase  Lower the bar by gradually reducing the muscular tension of the arms to allow a controlled descent of the bar to the thighs. Inhale during this movement. Simultaneously flex the hips and knees to cushion the impact of the bar on the thighs. Squat down with the elbows fully extended until the bar touches the floor. Start over at Phase 1 and repeat for the recommended amount of repetitions."
  },
  {
    "name": "Hang Snatch",
    "type": "olympic_weightlifting",
    "muscle": "hamstrings",
    "equipment": "barbell",
    "difficulty": "beginner",
    "instructions": "Begin with a wide grip on the bar, with an overhand or hook grip. The feet should be directly below the hips with the feet turned out. Your knees should be slightly bent, and the torso inclined forward. The spine should be fully extended and the head facing forward. The bar should be at the hips. This will be your starting position. Aggressively extend through the legs and hips. At peak extension, shrug the shoulders and allow the elbows to flex to the side. As you move your feet into the receiving position, forcefully pull yourself below the bar as you elevate the bar overhead. Receive the bar with your body as low as possible and the arms fully extended overhead. Return to a standing position with the weight overhead. Follow by returning the weight to the ground under control."
  },
  {
    "name": "Single-Leg Press",
    "type": "strength",
    "muscle": "quadriceps",
    "equipment": "machine",
    "difficulty": "intermediate",
    "instructions": "Load the sled to an appropriate weight. Seat yourself on the machine, planting one foot on the platform in line with your hip. Your free foot can be placed on the ground. Maintain good spinal position with your head and chest up. Supporting the weight, fully extend the knee and unlock the sled. This will be your starting position. Lower the weight by flexing the hip and knee, continuing as far as flexibility allows. Do not allow your lumbar to take the load by moving your pelvis. At the bottom of the motion pause briefly and then return to the starting position by extending the hip and knee. Complete all repetitions for one leg before switching to the other."
  },
  {
    "name": "Clean from Blocks",
    "type": "olympic_weightlifting",
    "muscle": "quadriceps",
    "equipment": "barbell",
    "difficulty": "beginner",
    "instructions": "With a barbell on boxes or stands of the desired height, take an overhand or hook grip just outside the legs. Lower your hips with the weight focused on the heels, back straight, head facing forward, chest up, with your shoulders just in front of the bar. This will be your starting position. Begin the first pull by driving through the heels, extending your knees. Your back angle should stay the same, and your arms should remain straight with the elbows pointed out. Next comes the second pull, the main source of acceleration for the clean. As the bar approaches the mid-thigh position, begin extending through the hips. In a jumping motion, accelerate by extending the hips, knees, and ankles, using speed to move the bar upward. There should be no need to actively pull through the arms to accelerate the weight. At the end of the second pull, the body should be fully extended, leaning slightly back, with the arms still extended.3.  As full extension is achieved, transition into the receiving position by aggressively shrugging and flexing the arms with the elbows up and out. Aggressively pull yourself down, rotating your elbows under the bar as you do so. Receive the bar in a front squat position, the depth of which is dependent upon the height of the bar at the end of the third pull. The bar should be racked onto the protracted shoulders, lightly touching the throat with the hands relaxed. Continue to descend to the bottom squat position, which will help in the recovery. Immediately recover by driving through the heels, keeping the torso upright and elbows up. Continue until you have risen to a standing position. Return the weight to the boxes for the next rep."
  },
  {
    "name": "Barbell Full Squat",
    "type": "strength",
    "muscle": "quadriceps",
    "equipment": "barbell",
    "difficulty": "intermediate",
    "instructions": "This exercise is best performed inside a squat rack for safety purposes. To begin, first set the bar on a rack just above shoulder level. Once the correct height is chosen and the bar is loaded, step under the bar and place the back of your shoulders (slightly below the neck) across it. Hold on to the bar using both arms at each side and lift it off the rack by first pushing with your legs and at the same time straightening your torso. Step away from the rack and position your legs using a shoulder-width medium stance with the toes slightly pointed out. Keep your head up at all times and maintain a straight back. This will be your starting position. Begin to slowly lower the bar by bending the knees and sitting back with your hips as you maintain a straight posture with the head up. Continue down until your hamstrings are on your calves. Inhale as you perform this portion of the movement. Begin to raise the bar as you exhale by pushing the floor with the heel or middle of your foot as you straighten the legs and extend the hips to go back to the starting position. Repeat for the recommended amount of repetitions.  This type of squat allows a greater range of motion, and allows the trunk to maintain a more vertical position than other types of squats, due to foot position and the higher bar position."
  },
  {
    "name": "Tire flip",
    "type": "strongman",
    "muscle": "quadriceps",
    "equipment": "other",
    "difficulty": "intermediate",
    "instructions": "Begin by gripping the bottom of the tire on the tread, and position your feet back a bit. Your chest should be driving into the tire. To lift the tire, extend through the hips, knees, and ankles, driving into the tire and up. As the tire reaches a 45 degree angle, step forward and drive a knee into the tire. As you do so adjust your grip to the upper portion of the tire and push it forward as hard as possible to complete the turn. Repeat as necessary."
  },
  {
    "name": "Barbell back squat to box",
    "type": "powerlifting",
    "muscle": "quadriceps",
    "equipment": "barbell",
    "difficulty": "intermediate",
    "instructions": "The box squat allows you to squat to desired depth and develop explosive strength in the squat movement. Begin in a power rack with a box at the appropriate height behind you. Typically, you would aim for a box height that brings you to a parallel squat, but you can train higher or lower if desired. Begin by stepping under the bar and placing it across the back of the shoulders. Squeeze your shoulder blades together and rotate your elbows forward, attempting to bend the bar across your shoulders. Remove the bar from the rack, creating a tight arch in your lower back, and step back into position. Place your feet wider for more emphasis on the back, glutes, adductors, and hamstrings, or closer together for more quad development. Keep your head facing forward. With your back, shoulders, and core tight, push your knees and butt out and you begin your descent. Sit back with your hips until you are seated on the box. Ideally, your shins should be perpendicular to the ground. Pause when you reach the box, and relax the hip flexors. Never bounce off of a box. Keeping the weight on your heels and pushing your feet and knees out, drive upward off of the box as you lead the movement with your head. Continue upward, maintaining tightness head to toe."
  },
  {
    "name": "Push-press",
    "type": "olympic_weightlifting",
    "muscle": "quadriceps",
    "equipment": "barbell",
    "difficulty": "intermediate",
    "instructions": "Beginning Position:  Use the floor-to-shoulder lifting technique described in the Power Clean exercise to move the bar from the floor to the shoulders.  Upward Movement Phase:  Slightly flex the hips and knees, keeping torso erect. Immediately follow with an explosive push upward by extending the knees. Keep torso erect and tensed. At maximum hip and knee extension, shift body weight to balls of feet and extend ankle joints. At maximum plantar flexion, push bar from the shoulders. Push the bar with the arms to a fully extended elbow position overhead.  Downward Movement Phase:  Lower bar to shoulders. Flex hips and knees slightly as bar touches shoulders. Straighten the hips and knees before the upward movement phase begins again.  Breathing:  Exhale through the sticking point of the upward movement phase. Inhale during the downward movement phase."
  },
  {
    "name": "Power snatch-",
    "type": "olympic_weightlifting",
    "muscle": "quadriceps",
    "equipment": "barbell",
    "difficulty": "expert",
    "instructions": "Place your feet at a shoulder width stance with the barbell resting right above the connection between the toes and the rest of the foot. With a palms facing down grip, bend at the knees and keeping the back flat grab the bar using a wider than shoulder width grip. Bring the hips down and make sure that your body drops as if you were going to sit on a chair. This will be your starting position. Start pushing the floor as if it were a moving platform with your feet and simultaneously start lifting the barbell keeping it close to your legs. As the bar reaches the middle of your thighs, push the floor with your legs and lift your body to a complete extension in an explosive motion. Lift your shoulders back in a shrugging movement as you bring the bar up while lifting your elbows out to the side and keeping them above the bar for as long as possible. Now in a very quick but powerful motion, you have to get your body under the barbell when it has reached a high enough point where it can be controlled and drop while locking your arms and holding the barbell overhead as you assume a squat position. Finalize the movement by rising up out of the squat position to finish the lift. At the end of the lift both feet should be on line and the arms fully extended holding the barbell overhead.  Caution: This is a very advanced exercise so be extremely careful with the weight used. Bad form on this exercise can lead to serious injury."
  },
  {
    "name": "Hang Clean",
    "type": "olympic_weightlifting",
    "muscle": "quadriceps",
    "equipment": "barbell",
    "difficulty": "beginner",
    "instructions": "Begin with a shoulder width, double overhand or hook grip, with the bar hanging at the mid thigh position. Your back should be straight and inclined slightly forward. Begin by aggressively extending through the hips, knees and ankles, driving the weight upward. As you do so, shrug your shoulders towards your ears. As full extension is achieved, transition into the final pull by aggressively shrugging and flexing the arms with the elbows up and out. At peak extension, aggressively pull yourself down, rotating your elbows under the bar as you do so. Receive the bar in a front squat position, the depth of which is dependent upon the height of the bar at the end of the third pull. The bar should be racked onto the protracted shoulders, lightly touching the throat with the hands relaxed. Continue to descend to the bottom squat position, which will help in the recovery.3.  Immediately recover by driving through the heels, keeping the torso upright and elbows up. Continue until you have risen to a standing position."
  },
  {
    "name": "Reverse Band Box Squat",
    "type": "powerlifting",
    "muscle": "quadriceps",
    "equipment": "None",
    "difficulty": "intermediate",
    "instructions": "Begin in a power rack with a box at the appropriate height behind you. Set up the bands either on band pegs or attached to the top of the rack, ensuring they will be directly above the bar during the squat. Attach the other end to the bar. Begin by stepping under the bar and placing it across the back of the shoulders. Squeeze your shoulder blades together and rotate your elbows forward, attempting to bend the bar across your shoulders. Remove the bar from the rack, creating a tight arch in your lower back, and step back into position. Place your feet wider for more emphasis on the back, glutes, adductors, and hamstrings, or closer together for more quad development. Keep your head facing forward. With your back, shoulders, and core tight, push your knees and butt out and you begin your descent. Sit back with your hips until you are seated on the box. Ideally, your shins should be perpendicular to the ground. Pause when you reach the box, and relax the hip flexors. Never bounce off of a box. Keeping the weight on your heels and pushing your feet and knees out, drive upward off of the box as you lead the movement with your head. Continue upward, maintaining tightness head to toe. Use care to return the barbell to the rack."
  },
  {
    "name": "Jumping rope",
    "type": "cardio",
    "muscle": "quadriceps",
    "equipment": "body_only",
    "difficulty": "intermediate",
    "instructions": "Hold an end of the rope in each hand. Position the rope behind you on the ground. Raise your arms up and turn the rope over your head bringing it down in front of you. When it reaches the ground, jump over it. Find a good turning pace that can be maintained. Different speeds and techniques can be used to introduce variation. Rope jumping is exciting, challenges your coordination, and requires a lot of energy. A 150 lb person will burn about 350 calories jumping rope for 30 minutes, compared to over 450 calories running."
  },
  {
    "name": "Barbell walking lunge",
    "type": "strength",
    "muscle": "quadriceps",
    "equipment": "barbell",
    "difficulty": "intermediate",
    "instructions": "Begin standing with your feet shoulder width apart and a barbell across your upper back. Step forward with one leg, flexing the knees to drop your hips. Descend until your rear knee nearly touches the ground. Your posture should remain upright, and your front knee should stay above the front foot. Drive through the heel of your lead foot and extend both knees to raise yourself back up. Step forward with your rear foot, repeating the lunge on the opposite leg."
  },
  {
    "name": "Front Squats With Two Kettlebells",
    "type": "strength",
    "muscle": "quadriceps",
    "equipment": "kettlebells",
    "difficulty": "beginner",
    "instructions": "Clean two kettlebells to your shoulders. Clean the kettlebells to your shoulders by extending through the legs and hips as you pull the kettlebells towards your shoulders. Rotate your wrists as you do so. Looking straight ahead at all times, squat as low as you can and pause at the bottom. As you squat down, push your knees out. You should squat between your legs, keeping an upright torso, with your head and chest up. Rise back up by driving through your heels and repeat."
  },
  {
    "name": "Single Leg Push-off",
    "type": "plyometrics",
    "muscle": "quadriceps",
    "equipment": "other",
    "difficulty": "beginner",
    "instructions": "Stand on the ground with one foot resting on the box, heel close to the edge. Push off with your foot on top of the box, trying to gain as much height as possible by extending through the hip and knee. Land with the same foot on top of the box, returning your other foot back to the start position."
  },
  {
    "name": "Olympic Squat",
    "type": "olympic_weightlifting",
    "muscle": "quadriceps",
    "equipment": "barbell",
    "difficulty": "beginner",
    "instructions": "Begin with a barbell supported on top of the traps. The chest should be up, and the head facing forward. Adopt a hip width stance with the feet turned out as needed. Descend by flexing the knees, refraining from moving the hips back as much as possible. This requires that the knees travel forward; ensure that they stay aligned with the feet. The goal is to keep the torso as upright as possible. Continue all the way down, keeping the weight on the front of the heel. At the moment the upper legs contact the lower, reverse the motion, driving the weight upward."
  },
  {
    "name": "Stair climber",
    "type": "cardio",
    "muscle": "quadriceps",
    "equipment": "machine",
    "difficulty": "intermediate",
    "instructions": "To begin, step onto the stepmill and select the desired option from the menu. You can choose a manual setting, or you can select a program to run. Typically, you can enter your age and weight to estimate the amount of calories burned during exercise. Use caution so that you dont trip as you climb the stairs. It is recommended that you maintain your grip on the handles so that you dont fall. Stepmills offer convenience, cardiovascular benefits, and usually have less impact than running outside while offering a similar rate of calories burned. They are typically much harder than other cardio equipment. A 150 lb person will typically burn over 300 calories in 30 minutes, compared to about 175 calories walking."
  },
  {
    "name": "Kettlebell Pistol Squat",
    "type": "strength",
    "muscle": "quadriceps",
    "equipment": "kettlebells",
    "difficulty": "beginner",
    "instructions": "Pick up a kettlebell with two hands and hold it by the horns. Hold one leg off of the floor and squat down on the other. Squat down by flexing the knee and sitting back with the hips, holding the kettlebell up in front of you. Hold the bottom position for a second and then reverse the motion, driving through the heel and keeping your head and chest up. Lower yourself again and repeat."
  },
  {
    "name": "Forward lunge",
    "type": "strength",
    "muscle": "quadriceps",
    "equipment": "body_only",
    "difficulty": "intermediate",
    "instructions": "Stand erect with your feet hip-width apart, chest out, and shoulders back, maintaining the natural curvature of your spine. Your knees should be unlocked and your hand on your hips. This is your starting position. Take a moderate-length step forward with one foot, descending to a point in which your rear knee approaches the floor without touching, maintaining your body's upright posture. Your front knee should bend about 90 degrees, but for knee health it should not be forward of the vertical plane that extends straight up from your toes. If so, take a slightly longer step. From the bottom position, push back up from your forward foot, bringing it back beside the other. Repeat on the opposite side for the required number of repetitions."
  },
  {
    "name": "Narrow-stance squat",
    "type": "strength",
    "muscle": "quadriceps",
    "equipment": "barbell",
    "difficulty": "expert",
    "instructions": "This exercise is best performed inside a squat rack for safety purposes. To begin, first set the bar on a rack that best matches your height. Once the correct height is chosen and the bar is loaded, step under the bar and place the back of your shoulders (slightly below the neck) across it. Hold on to the bar using both arms at each side and lift it off the rack by first pushing with your legs and at the same time straightening your torso. Step away from the rack and position your legs using a less-than-shoulder-width narrow stance with the toes slightly pointed out. Feet should be around 3-6 inches apart. Keep your head up at all times (looking down will get you off balance) and maintain a straight back. This will be your starting position. (Note: For the purposes of this discussion we will use the medium stance described above which targets overall development; however you can choose any of the three stances discussed in the foot stances section). Begin to slowly lower the bar by bending the knees as you maintain a straight posture with the head up. Continue down until the angle between the upper leg and the calves becomes slightly less than 90-degrees (which is the point in which the upper legs are below parallel to the floor). Inhale as you perform this portion of the movement. Tip: If you performed the exercise correctly, the front of the knees should make an imaginary straight line with the toes that is perpendicular to the front. If your knees are past that imaginary line (if they are past your toes) then you are placing undue stress on the knee and the exercise has been performed incorrectly. Begin to raise the bar as you exhale by pushing the floor with the heel of your foot mainly as you straighten the legs again and go back to the starting position. Repeat for the recommended amount of repetitions.  Caution: This is not an exercise to be taken lightly. If you have back issues, substitute it with the dumbbell squat variation or a leg press instead. If you have a healthy back, ensure perfect form and never slouch the back forward as this can cause back injury. Be cautious as well with the weight used; in case of doubt, use less weight rather than more. The squat is a very safe exercise but only if performed properly. Variations: As previously mentioned, there are various stances that can be used depending on what you want to emphasize. You can also place a small block under the heels to improve balance. Dumbbells can be used as well for resistance by holding them to your sides. The use of wrist wraps is a necessity due to the amount of weights used. I find this an excellent variation when my lower back begins to act up after many weeks of regular barbell squats. (Note: For wide-stance dumbbell squats you will have to hold the dumbbells in between your legs as opposed to both sides in order to be able to distance your legs sufficiently). Another way to perform these is by using a weight belt and attaching weights to it in between the legs. This variation is referred to as weight-belt squats which need to be performed with the legs placed on two well secured, raised, but separated platforms, that allow the weights to go up and down in the middle. This exercise is an excellent choice for people with lower back problems. The issue however is finding the platforms that meet the criteria. The only way I have been able to perform this is when I have two benches placed opposite to each other with spotting platforms that are facing each other. If you move the benches close enough then you get can execute the weight-belt squats by using the spotting platform. Finally, you can also perform squats in a Smith Machine though I do not recommend this. The reason for not performing regular squats on the Smith Machine is that since the machine allows you to execute the exercise while leaning versus the bar, hip flexor involvement is minimized taking the hamstring out of the exercise. While this does take pressure off the lower back, hamstring involvement is a requirement to stabilize the knee-cap. So, as a result, what is created is a situation where destructive forces place a huge stress on the ACL (anterior cruciate ligament; a primary ligament in the knee capsule whose job is to provide knee stability) by pushing the knee-cap forward. For this reason, I highly recommend against Smith Machine use for squats. If you still insist on doing so, make sure it is a sporadic use rather than frequent, and also be sure to control the amount of weight used."
  },
  {
    "name": "Bear crawl sled drag",
    "type": "strongman",
    "muscle": "quadriceps",
    "equipment": "other",
    "difficulty": "intermediate",
    "instructions": "Wearing either a harness or a loose weight belt, attach the chain to the back so that you will be facing away from the sled. Bend down so that your hands are on the ground. Your back should be flat and knees bent. This is your starting position. Begin by driving with legs, alternating left and right. Use your hands to maintain balance and to help pull. Try to keep your back flat as you move over a given distance."
  }
]