[
  {
    "name": "Incline Hammer Curls",
    "type": "strength",
    "muscle": "arm",
    "equipment": "dumbbell",
    "instructions": "Seat yourself on an incline bench with a dumbbell in each hand. You should pressed firmly against he back with your feet together. Allow the dumbbells to hang straight down at your side, holding them with a neutral grip. This will be your starting position. Initiate the movement by flexing at the elbow, attempting to keep the upper arm stationary. Continue to the top of the movement and pause, then slowly return to the start position.",
    "thumbnail": "https://i.ytimg.com/vi/OPqe0kCxmR8/hq720.jpg",
    "kcal": 139,
    "duration": 17,
    "level": "Beginner",
    "video": "https://www.youtube.com/watch?v=OPqe0kCxmR8"
  },
  {
    "name": "Wide-grip barbell curl",
    "type": "strength",
    "muscle": "arm",
    "equipment": "barbell",
    "instructions": "Stand up with your torso upright while holding a barbell at the wide outer handle. The palm of your hands should be facing forward. The elbows should be close to the torso. This will be your starting position. While holding the upper arms stationary, curl the weights forward while contracting the biceps as you breathe out. Tip: Only the forearms should move. Continue the movement until your biceps are fully contracted and the bar is at shoulder level. Hold the contracted position for a second and squeeze the biceps hard. Slowly begin to bring the bar back to starting position as your breathe in. Repeat for the recommended amount of repetitions.  Variations:  You can also perform this movement using an E-Z bar or E-Z attachment hooked to a low pulley. This variation seems to really provide a good contraction at the top of the movement. You may also use the closer grip for variety purposes.",
    "thumbnail": "https://i.ytimg.com/vi/jnfveKq1i3E/hq720.jpg",
    "kcal": 144,
    "duration": 29,
    "level": "Beginner",
    "video": "https://www.youtube.com/watch?v=jnfveKq1i3E"
  },
  {
    "name": "EZ-bar spider curl",
    "type": "strength",
    "muscle": "arm",
    "equipment": "barbell",
    "instructions": "Start out by setting the bar on the part of the preacher bench that you would normally sit on. Make sure to align the barbell properly so that it is balanced and will not fall off. Move to the front side of the preacher bench (the part where the arms usually lay) and position yourself to lay at a 45 degree slant with your torso and stomach pressed against the front side of the preacher bench. Make sure that your feet (especially the toes) are well positioned on the floor and place your upper arms on top of the pad located on the inside part of the preacher bench. Use your arms to grab the barbell with a supinated grip (palms facing up) at about shoulder width apart or slightly closer from each other. Slowly begin to lift the barbell upwards and exhale. Hold the contracted position for a second as you squeeze the biceps. Slowly begin to bring the barbell back to the starting position as your breathe in. . Repeat for the recommended amount of repetitions.  Variation: You can also use dumbbells when performing this exercise. Just make sure you place the dumbbells on the part of the preacher bench where you would normally sit properly.",
    "thumbnail": "https://i.ytimg.com/vi/WG3vdcq__I0/hq720.jpg",
    "kcal": 145,
    "duration": 20,
    "level": "Intermediate",
    "video": "https://www.youtube.com/watch?v=WG3vdcq__I0"
  },
  {
    "name": "Hammer Curls",
    "type": "strength",
    "muscle": "arm",
    "equipment": "dumbbell",
    "instructions": "Stand up with your torso upright and a dumbbell on each hand being held at arms length. The elbows should be close to the torso. The palms of the hands should be facing your torso. This will be your starting position. Now, while holding your upper arm stationary, exhale and curl the weight forward while contracting the biceps. Continue to raise the weight until the biceps are fully contracted and the dumbbell is at shoulder level. Hold the contracted position for a brief moment as you squeeze the biceps. Tip: Focus on keeping the elbow stationary and only moving your forearm. After the brief pause, inhale and slowly begin the lower the dumbbells back down to the starting position. Repeat for the recommended amount of repetitions.  Variations: There are many possible variations for this movement. For instance, you can perform the exercise sitting down on a bench with or without back support and you can also perform it by alternating arms; first lift the right arm for one repetition, then the left, then the right, etc.",
    "thumbnail": "https://i.ytimg.com/vi/OPqe0kCxmR8/hq720.jpg",
    "kcal": 107,
    "duration": 30,
    "level": "Intermediate",
    "video": "https://www.youtube.com/watch?v=OPqe0kCxmR8"
  },
  {
    "name": "EZ-Bar Curl",
    "type": "strength",
    "muscle": "arm",
    "equipment": "e-z_curl_bar",
    "instructions": "Stand up straight while holding an EZ curl bar at the wide outer handle. The palms of your hands should be facing forward and slightly tilted inward due to the shape of the bar. Keep your elbows close to your torso. This will be your starting position. Now, while keeping your upper arms stationary, exhale and curl the weights forward while contracting the biceps. Focus on only moving your forearms. Continue to raise the weight until your biceps are fully contracted and the bar is at shoulder level. Hold the top contracted position for a moment and squeeze the biceps. Then inhale and slowly lower the bar back to the starting position. Repeat for the recommended amount of repetitions.  Variations: You can also perform this movement using an E-Z attachment hooked to a low pulley. This variation seems to really provide a good contraction at the top of the movement. You may also use the closer grip for variety purposes.",
    "thumbnail": "https://i.ytimg.com/vi/-gSM-kqNlUw/hq720.jpg",
    "kcal": 117,
    "duration": 14,
    "level": "Intermediate",
    "video": "https://www.youtube.com/watch?v=-gSM-kqNlUw"
  },
  {
    "name": "Zottman Curl",
    "type": "strength",
    "muscle": "arm",
    "equipment": "None",
    "instructions": "Stand up with your torso upright and a dumbbell in each hand being held at arms length. The elbows should be close to the torso. Make sure the palms of the hands are facing each other. This will be your starting position. While holding the upper arm stationary, curl the weights while contracting the biceps as you breathe out. Only the forearms should move. Your wrist should rotate so that you have a supinated (palms up) grip. Continue the movement until your biceps are fully contracted and the dumbbells are at shoulder level. Hold the contracted position for a second as you squeeze the biceps. Now during the contracted position, rotate your wrist until you now have a pronated (palms facing down) grip with the thumb at a higher position than the pinky. Slowly begin to bring the dumbbells back down using the pronated grip. As the dumbbells close your thighs, start rotating the wrist so that you go back to a neutral (palms facing your body) grip. Repeat for the recommended amount of repetitions.",
    "thumbnail": "https://i.ytimg.com/vi/ZrpRBgswtHs/hq720.jpg",
    "kcal": 98,
    "duration": 11,
    "level": "Intermediate",
    "video": "https://www.youtube.com/watch?v=ZrpRBgswtHs"
  },
  {
    "name": "Biceps curl to shoulder press",
    "type": "strength",
    "muscle": "arm",
    "equipment": "dumbbell",
    "instructions": "Begin in a standing position with a dumbbell in each hand. Your arms should be hanging at your sides with your palms facing forward. Look directly ahead, keeping your chest up, with your feet shoulder-width apart. This will be your starting position. Initiate the movement by flexing the elbows to curl the weight. Do not use momentum or flex through the shoulder, instead use a controlled motion. Execute the pressing movement by extending the arm, flexing and abducting the shoulder to rotate the arm as you press above your head. Pause at the top of the motion before reversing the movement to return to the starting position. Complete the desired number of repetitions before switching to the opposite side.",
    "thumbnail": "https://i.ytimg.com/vi/MkSxYPEnpws/hqdefault.jpg",
    "kcal": 137,
    "duration": 24,
    "level": "Beginner",
    "video": "https://www.youtube.com/watch?v=MkSxYPEnpws"
  },
  {
    "name": "Barbell Curl",
    "type": "strength",
    "muscle": "arm",
    "equipment": "barbell",
    "instructions": "Stand up with your torso upright while holding a barbell at a shoulder-width grip. The palm of your hands should be facing forward and the elbows should be close to the torso. This will be your starting position. While holding the upper arms stationary, curl the weights forward while contracting the biceps as you breathe out. Tip: Only the forearms should move. Continue the movement until your biceps are fully contracted and the bar is at shoulder level. Hold the contracted position for a second and squeeze the biceps hard. Slowly begin to bring the bar back to starting position as your breathe in. Repeat for the recommended amount of repetitions.  Variations:  You can also perform this movement using a straight bar attachment hooked to a low pulley. This variation seems to really provide a good contraction at the top of the movement. You may also use the closer grip for variety purposes.",
    "thumbnail": "https://i.ytimg.com/vi/kwG2ipFRgfo/hq720.jpg",
    "kcal": 96,
    "duration": 13,
    "level": "Intermediate",
    "video": "https://www.youtube.com/watch?v=kwG2ipFRgfo"
  },
  {
    "name": "Concentration curl",
    "type": "strength",
    "muscle": "arm",
    "equipment": "dumbbell",
    "instructions": "Sit down on a flat bench with one dumbbell in front of you between your legs. Your legs should be spread with your knees bent and feet on the floor. Use your right arm to pick the dumbbell up. Place the back of your right upper arm on the top of your inner right thigh. Rotate the palm of your hand until it is facing forward away from your thigh. Tip: Your arm should be extended and the dumbbell should be above the floor. This will be your starting position. While holding the upper arm stationary, curl the weights forward while contracting the biceps as you breathe out. Only the forearms should move. Continue the movement until your biceps are fully contracted and the dumbbells are at shoulder level. Tip: At the top of the movement make sure that the little finger of your arm is higher than your thumb. This guarantees a good contraction. Hold the contracted position for a second as you squeeze the biceps. Slowly begin to bring the dumbbells back to starting position as your breathe in. Caution: Avoid swinging motions at any time. Repeat for the recommended amount of repetitions. Then repeat the movement with the left arm.  Variations: This exercise can be performed standing with the torso bent forward and the arm in front of you. In this case, no leg support is used for the back of your arm so you will need to make extra effort to ensure no movement of the upper arm. This is a more challenging version of the exercise and is not recommended for people with lower back issues.",
    "thumbnail": "https://i.ytimg.com/vi/0AUGkch3tzc/hq720.jpg",
    "kcal": 147,
    "duration": 17,
    "level": "Intermediate",
    "video": "https://www.youtube.com/watch?v=0AUGkch3tzc"
  },
  {
    "name": "Flexor Incline Dumbbell Curls",
    "type": "strength",
    "muscle": "arm",
    "equipment": "dumbbell",
    "instructions": "Hold the dumbbell towards the side farther from you so that you have more weight on the side closest to you. (This can be done for a good effect on all bicep dumbbell exercises). Now do a normal incline dumbbell curl, but keep your wrists as far back as possible so as to neutralize any stress that is placed on them. Sit on an incline bench that is angled at 45-degrees while holding a dumbbell on each hand. Let your arms hang down on your sides, with the elbows in, and turn the palms of your hands forward with the thumbs pointing away from the body. Tip: You will keep this hand position throughout the movement as there should not be any twisting of the hands as they come up. This will be your starting position. Curl up the two dumbbells at the same time until your biceps are fully contracted and exhale. Tip: Do not swing the arms or use momentum. Keep a controlled motion at all times. Hold the contracted position for a second at the top. As you inhale, slowly go back to the starting position. Repeat for the recommended amount of repetitions.  Caution: Do not extend your arms totally as you could injure your elbows if you hyperextend them. Also, make sure that on the way down you move slowly to avoid injury. Variations: You can use cables for this movement as well.",
    "thumbnail": "https://i.ytimg.com/vi/soxrZlIl35U/hq720.jpg",
    "kcal": 149,
    "duration": 22,
    "level": "Beginner",
    "video": "https://www.youtube.com/watch?v=soxrZlIl35U"
  },
  {
    "name": "Machine Bicep Curl",
    "type": "strength",
    "muscle": "arm",
    "equipment": "machine",
    "instructions": "Adjust the seat to the appropriate height and make your weight selection. Place your upper arms against the pads and grasp the handles. This will be your starting position. Perform the movement by flexing the elbow, pulling your lower arm towards your upper arm. Pause at the top of the movement, and then slowly return the weight to the starting position. Avoid returning the weight all the way to the stops until the set is complete to keep tension on the muscles being worked.",
    "thumbnail": "https://i.ytimg.com/vi/kfE9Plm8Hks/hqdefault.jpg",
    "kcal": 59,
    "duration": 21,
    "level": "Beginner",
    "video": "https://www.youtube.com/watch?v=kfE9Plm8Hks"
  },
  {
    "name": "Overhead cable curl",
    "type": "strength",
    "muscle": "arm",
    "equipment": "cable",
    "instructions": "To begin, set a weight that is comfortable on each side of the pulley machine. Note: Make sure that the amount of weight selected is the same on each side. Now adjust the height of the pulleys on each side and make sure that they are positioned at a height higher than that of your shoulders. Stand in the middle of both sides and use an underhand grip (palms facing towards the ceiling) to grab each handle. Your arms should be fully extended and parallel to the floor with your feet positioned shoulder width apart from each other. Your body should be evenly aligned the handles. This is the starting position. While exhaling, slowly squeeze the biceps on each side until your forearms and biceps touch. While inhaling, move your forearms back to the starting position. Note: Your entire body is stationary during this exercise except for the forearms. Repeat for the recommended amount of repetitions prescribed in your program.  Variations: This exercise can also be performed using one handle at a time.",
    "thumbnail": "https://i.ytimg.com/vi/Ew6Stze6ei4/hqdefault.jpg",
    "kcal": 132,
    "duration": 24,
    "level": "Intermediate",
    "video": "https://www.youtube.com/watch?v=Ew6Stze6ei4"
  },
  {
    "name": "Dumbbell Bicep Curl",
    "type": "strength",
    "muscle": "arm",
    "equipment": "dumbbell",
    "instructions": "Stand up straight with a dumbbell in each hand at arm's length. Keep your elbows close to your torso and rotate the palms of your hands until they are facing forward. This will be your starting position. Now, keeping the upper arms stationary, exhale and curl the weights while contracting your biceps. Continue to raise the weights until your biceps are fully contracted and the dumbbells are at shoulder level. Hold the contracted position for a brief pause as you squeeze your biceps. Then, inhale and slowly begin to lower the dumbbells back to the starting position. Repeat for the recommended amount of repetitions.  Variations: There are many possible variations for this movement. For instance, you can perform the exercise sitting down on a bench with or without back support and you can also perform it by alternating arms; first lift the right arm for one repetition, then the left, then the right, etc. You can also do the exercise starting with both palms of the hands facing the torso and then rotating forward as the movement is performed. At the top of the movement the palms should face forward and the small finger should be higher than the thumb for a peak contraction.",
    "thumbnail": "https://i.ytimg.com/vi/JyV7mUFSpXs/hq720.jpg",
    "kcal": 90,
    "duration": 18,
    "level": "Intermediate",
    "video": "https://www.youtube.com/watch?v=JyV7mUFSpXs"
  },
  {
    "name": "Close-grip EZ-bar curl",
    "type": "strength",
    "muscle": "arm",
    "equipment": "barbell",
    "instructions": "Stand up with your torso upright while holding an E-Z Curl Bar at the closer inner handle. The palm of your hands should be facing forward and they should be slightly tilted inwards due to the shape of the bar. The elbows should be close to the torso. This will be your starting position. While holding the upper arms stationary, curl the weights forward while contracting the biceps as you breathe out. Tip: Only the forearms should move. Continue the movement until your biceps are fully contracted and the bar is at shoulder level. Hold the contracted position for a second and squeeze the biceps hard. Slowly begin to bring the bar back to starting position as your breathe in. Repeat for the recommended amount of repetitions.  Variations:  You can also perform this movement using an E-Z attachment hooked to a low pulley. This variation seems to really provide a good contraction at the top of the movement. You may also use the wider grip for variety purposes.",
    "thumbnail": "https://i.ytimg.com/vi/1bGHpNt0vhU/hq720.jpg",
    "kcal": 108,
    "duration": 14,
    "level": "Beginner",
    "video": "https://www.youtube.com/watch?v=1bGHpNt0vhU"
  },
  {
    "name": "Cross-body hammer curl",
    "type": "strength",
    "muscle": "arm",
    "equipment": "dumbbell",
    "instructions": "Stand up straight with a dumbbell in each hand. Your hands should be down at your side with your palms facing in. While keeping your palms facing in and without twisting your arm, curl the dumbbell of the right arm up towards your left shoulder as you exhale. Touch the top of the dumbbell to your shoulder and hold the contraction for a second. Slowly lower the dumbbell along the same path as you inhale and then repeat the same movement for the left arm. Continue alternating in this fashion until the recommended amount of repetitions is performed for each arm.  Variations: You can also perform this exercise in between two pulleys using the end of a rope attachment on each arm.",
    "thumbnail": "https://i.ytimg.com/vi/On2eca-C00E/hqdefault.jpg",
    "kcal": 64,
    "duration": 22,
    "level": "Beginner",
    "video": "https://www.youtube.com/watch?v=On2eca-C00E"
  },
  {
    "name": "Preacher Curl",
    "type": "strength",
    "muscle": "arm",
    "equipment": "barbell",
    "instructions": "To perform this movement you will need a preacher bench and an E-Z bar. Grab the E-Z curl bar at the close inner handle (either have someone hand you the bar which is preferable or grab the bar from the front bar rest provided by most preacher benches). The palm of your hands should be facing forward and they should be slightly tilted inwards due to the shape of the bar. With the upper arms positioned against the preacher bench pad and the chest against it, hold the E-Z Curl Bar at shoulder length. This will be your starting position. As you breathe in, slowly lower the bar until your upper arm is extended and the biceps is fully stretched. As you exhale, use the biceps to curl the weight up until your biceps is fully contracted and the bar is at shoulder height. Squeeze the biceps hard and hold this position for a second. Repeat for the recommended amount of repetitions.  Variations: You can perform this exercise also using a low pulley with an E-Z Bar attachment instead. In this case you will need to position the bench in front of the pulley. You may also use a wider grip for variety purposes.",
    "thumbnail": "https://i.ytimg.com/vi/Zbs3ko8ycyg/hq720.jpg",
    "kcal": 127,
    "duration": 24,
    "level": "Intermediate",
    "video": "https://www.youtube.com/watch?v=Zbs3ko8ycyg"
  },
  {
    "name": "Barbell Curls Lying Against An Incline",
    "type": "strength",
    "muscle": "arm",
    "equipment": "barbell",
    "instructions": "Lie against an incline bench, with your arms holding a barbell and hanging down in a horizontal line. This will be your starting position. While keeping the upper arms stationary, curl the weight up as high as you can while squeezing the biceps. Breathe out as you perform this portion of the movement. Tip: Only the forearms should move. Do not swing the arms. After a second contraction, slowly go back to the starting position as you inhale. Tip: Make sure that you go all of the way down. Repeat for the recommended amount of repetitions.  Variations: You can perform this exercise using an E-Z bar or dumbbells.",
    "thumbnail": "https://i.ytimg.com/vi/k5u2IwU06o8/hq720.jpg",
    "kcal": 150,
    "duration": 24,
    "level": "Beginner",
    "video": "https://www.youtube.com/watch?v=k5u2IwU06o8"
  },
  {
    "name": "Seated Close-Grip Concentration Barbell Curl",
    "type": "strength",
    "muscle": "arm",
    "equipment": "barbell",
    "instructions": "Sit down on a flat bench with a barbell or E-Z Bar in front of you in between your legs. Your legs should be spread with the knees bent and the feet on the floor. Use your arms to pick the barbell up and place the back of your upper arms on top of your inner thighs (around three and a half inches away from the front of the knee). A supinated grip closer than shoulder width is needed to perform this exercise. Tip: Your arm should be extended at arms length and the barbell should be above the floor. This will be your starting position. While holding the upper arms stationary, curl the weights forward while contracting the biceps as you breathe out. Only the forearms should move. Continue the movement until your biceps are fully contracted and the dumbbells are at shoulder level. Hold the contracted position for a second as you squeeze the biceps. Slowly begin to bring the barbell back to starting position as your breathe in. Tip: Avoid swinging motions at any time. Repeat for the recommended amount of repetitions.  Variations: This exercise can be performed standing with the torso bent forward and the arm in front of you. In this case, no leg support is used for the back of your arm so you will need to make extra effort to ensure no movement of the upper arms. This is a more challenging version of the exercise and is not recommended for people with lower back issues. You can also perform as described here but without using a bench. So for this version you will be kneeling and the weight of the barbell will help to balance you.",
    "thumbnail": "https://i.ytimg.com/vi/0YYE2xVL5GU/hqdefault.jpg",
    "kcal": 84,
    "duration": 12,
    "level": "Beginner",
    "video": "https://www.youtube.com/watch?v=0YYE2xVL5GU"
  },
  {
    "name": "Reverse Barbell Preacher Curls",
    "type": "strength",
    "muscle": "arm",
    "equipment": "e-z_curl_bar",
    "instructions": "Grab an EZ-bar using a shoulder width and palms down (pronated) grip. Now place the upper part of both arms on top of the preacher bench and have your arms extended. This will be your starting position. As you exhale, use the biceps to curl the weight up until your biceps are fully contracted and the barbell is at shoulder height. Squeeze the biceps hard for a second at the contracted position. As you breathe in, slowly lower the barbell until your upper arms are extended and the biceps is fully stretched. Repeat for the recommended amount of repetitions.  Variations:  This exercise can be performed using an e-z bar, cables or dumbbells.",
    "thumbnail": "https://i.ytimg.com/vi/Gydpcouclx8/hq720.jpg",
    "kcal": 92,
    "duration": 30,
    "level": "Beginner",
    "video": "https://www.youtube.com/watch?v=Gydpcouclx8"
  },
  {
    "name": "Rickshaw Carry",
    "type": "strongman",
    "muscle": "arm",
    "equipment": "other",
    "instructions": "Position the frame at the starting point, and load with the appropriate weight. Standing in the center of the frame, begin by gripping the handles and driving through your heels to lift the frame. Ensure your chest and head are up and your back is straight. Immediately begin walking briskly with quick, controlled steps. Keep your chest up and head forward, and make sure you continue breathing. Bring the frame to the ground after you have reached the end point.",
    "thumbnail": "https://i.ytimg.com/vi/afSw5P58-bk/hq720.jpg",
    "kcal": 97,
    "duration": 22,
    "level": "Beginner",
    "video": "https://www.youtube.com/watch?v=afSw5P58-bk"
  },
  {
    "name": "Palms-down wrist curl over bench",
    "type": "strength",
    "muscle": "arm",
    "equipment": "barbell",
    "instructions": "Start out by placing a barbell on one side of a flat bench. Kneel down on both of your knees so that your body is facing the flat bench. Use your arms to grab the barbell with a pronated grip (palms down) and bring them up so that your forearms are resting against the flat bench. Your wrists should be hanging over the edge. Start out by curling your wrist upwards and exhaling. Slowly lower your wrists back down to the starting position while inhaling. Your forearms should be stationary as your wrist is the only movement needed to perform this exercise. Repeat for the recommended amount of repetitions.  Variations:  This exercise can also be performed sitting down by using your thighs as a resting position for your forearms. Your wrist can hang over your knees and the same movements as mentioned above can be performed. You can also use a dumbbell instead of a barbell.",
    "thumbnail": "https://i.ytimg.com/vi/sf9c-iQxRzw/hqdefault.jpg",
    "kcal": 125,
    "duration": 10,
    "level": "Intermediate",
    "video": "https://www.youtube.com/watch?v=sf9c-iQxRzw"
  },
  {
    "name": "Straight-bar wrist roll-up",
    "type": "strength",
    "muscle": "arm",
    "equipment": "None",
    "instructions": "Hold a barbell with both hands and your palms facing down; hands spaced about shoulder width. This will be your starting position. Alternating between each of your hands, perform the movement by extending the wrist as though you were rolling up a newspaper. Continue alternating back and forth until failure. Reverse the motion by flexing the wrist, rolling the opposite direction. Continue the alternating motion until failure.",
    "thumbnail": "https://i.ytimg.com/vi/-lOFG0U_rlY/hqdefault.jpg",
    "kcal": 110,
    "duration": 19,
    "level": "Intermediate",
    "video": "https://www.youtube.com/watch?v=-lOFG0U_rlY"
  },
  {
    "name": "Dumbbell farmer's walk",
    "type": "strongman",
    "muscle": "arm",
    "equipment": "other",
    "instructions": "There are various implements that can be used for the farmers walk. These can also be performed with heavy dumbbells or short bars if these implements aren't available. Begin by standing between the implements. After gripping the handles, lift them up by driving through your heels, keeping your back straight and your head up. Walk taking short, quick steps, and don't forget to breathe. Move for a given distance, typically 50-100 feet, as fast as possible.",
    "thumbnail": "https://i.ytimg.com/vi/nqGfgIVteoM/hq720.jpg",
    "kcal": 63,
    "duration": 22,
    "level": "Intermediate",
    "video": "https://www.youtube.com/watch?v=nqGfgIVteoM"
  },
  {
    "name": "Palms-up wrist curl over bench",
    "type": "strength",
    "muscle": "arm",
    "equipment": "barbell",
    "instructions": "Start out by placing a barbell on one side of a flat bench. Kneel down on both of your knees so that your body is facing the flat bench. Use your arms to grab the barbell with a supinated grip (palms up) and bring them up so that your forearms are resting against the flat bench. Your wrists should be hanging over the edge. Start out by curling your wrist upwards and exhaling. Slowly lower your wrists back down to the starting position while inhaling. Your forearms should be stationary as your wrist is the only movement needed to perform this exercise. Repeat for the recommended amount of repetitions.  Variations:  This exercise can also be performed sitting down by using your thighs as a resting position for your forearms. Your wrist can hang over your knees and the same movements as mentioned above can be performed. You can also use a dumbbell instead of a barbell.",
    "thumbnail": "https://i.ytimg.com/vi/3VLTzIrnb5g/hq720.jpg",
    "kcal": 122,
    "duration": 25,
    "level": "Intermediate",
    "video": "https://www.youtube.com/watch?v=3VLTzIrnb5g"
  },
  {
    "name": "Standing behind-the-back wrist curl",
    "type": "strength",
    "muscle": "arm",
    "equipment": "barbell",
    "instructions": "Start by standing straight and holding a barbell behind your glutes at arm's length while using a pronated grip (palms will be facing back away from the glutes) and having your hands shoulder width apart from each other. You should be looking straight forward while your feet are shoulder width apart from each other. This is the starting position. While exhaling, slowly elevate the barbell up by curling your wrist in a semi-circular motion towards the ceiling. Note: Your wrist should be the only body part moving for this exercise. Hold the contraction for a second and lower the barbell back down to the starting position while inhaling. Repeat for the recommended amount of repetitions. When finished, lower the barbell down to the squat rack or the floor by bending the knees. Tip: It is easiest to either pick it up from a squat rack or have a partner hand it to you.  Variations: You can also perform this exercise with dumbbells using the same movements as described above. Another option is to use one dumbbell at a time for better isolation.",
    "thumbnail": "https://i.ytimg.com/vi/xrS1UCC24do/hqdefault.jpg",
    "kcal": 119,
    "duration": 29,
    "level": "Beginner",
    "video": "https://www.youtube.com/watch?v=xrS1UCC24do"
  },
  {
    "name": "Seated finger curl",
    "type": "strength",
    "muscle": "arm",
    "equipment": "barbell",
    "instructions": "Hold a barbell with both hands and your palms facing up; hands spaced about shoulder width. Place your feet flat on the floor, at a distance that is slightly wider than shoulder width apart. This will be your starting position. Lower the bar as far as possible by extending the fingers. Allowing the bar to roll down the hands, catch the bar with the final joint in the fingers. Now curl bar up as high as possible by closing your hands while exhaling. Hold the contraction at the top.",
    "thumbnail": "https://i.ytimg.com/vi/mp61xNRZcrk/hq720.jpg",
    "kcal": 105,
    "duration": 10,
    "level": "Beginner",
    "video": "https://www.youtube.com/watch?v=mp61xNRZcrk"
  },
  {
    "name": "Seated Two-Arm Palms-Up Low-Pulley Wrist Curl",
    "type": "strength",
    "muscle": "arm",
    "equipment": "cable",
    "instructions": "Put a bench in front of a low pulley machine that has a barbell or EZ Curl attachment on it. Move the bench far enough away so that when you bring the handle to the top of your thighs tension is created on the cable due to the weight stack being moved up. Now hold the handle with both hands, palms up, using a shoulder-width grip. Step back and sit on the bench with your feet about shoulder width apart, firmly on the floor. Lean forward and place the forearms on your thighs with the back of your wrists over your knees. This will be your starting position. Lower the bar as far as possible, while inhaling and keeping a tight grip. Now curl the bar up as high as possible while contracting the forearms. Tip: Only the wrist should move; not the forearms. After a second contraction at the top go back to the starting position as you inhale. Repeat for the recommended amount of repetitions.  Variations: This exercise can be performed also with a single handle attachment (one arm at a time) or with free weights (barbells or dumbbells) using one arm and two arm variations.",
    "thumbnail": "https://i.ytimg.com/vi/_QhXMgl0xOI/hq720.jpg",
    "kcal": 55,
    "duration": 26,
    "level": "Beginner",
    "video": "https://www.youtube.com/watch?v=_QhXMgl0xOI"
  },
  {
    "name": "Wrist Roller",
    "type": "strength",
    "muscle": "arm",
    "equipment": "other",
    "instructions": "To begin, stand straight up grabbing a wrist roller using a pronated grip (palms facing down). Your feet should be shoulder width apart. Slowly lift both arms until they are fully extended and parallel to the floor in front of you. Note: Make sure the rope is not wrapped around the roller. Your entire body should be stationary except for the forearms. This is the starting position. Rotate one wrist at a time in an upward motion to bring the weight up to the bar by rolling the rope around the roller. Once the weight has reached the bar, slowly begin to lower the weight back down by rotating the wrist in a downward motion until the weight reaches the starting position. Repeat for the prescribed amount of repetitions in your program.",
    "thumbnail": "https://i.ytimg.com/vi/qb0A0pHGhyA/hq720.jpg",
    "kcal": 51,
    "duration": 23,
    "level": "Beginner",
    "video": "https://www.youtube.com/watch?v=qb0A0pHGhyA"
  },
  {
    "name": "Seated One-Arm Dumbbell Palms-Up Wrist Curl",
    "type": "strength",
    "muscle": "arm",
    "equipment": "dumbbell",
    "instructions": "Sit on a flat bench with a dumbbell in your right hand. Place your feet flat on the floor, at a distance that is slightly wider than shoulder width apart. Lean forward and place your right forearm on top of your upper right thigh with your palm up. Tip: Make sure that the front of the wrist lies on top of your knees. This will be your starting position. Lower the dumbbell as far as possible as you keep a tight grip on the dumbbell. Inhale as you perform this movement. Now curl the dumbbell as high as possible as you contract the forearms and as you exhale. Keep the contraction for a second before you lower again. Tip: The only movement should happen at the wrist. Perform for the recommended amount of repetitions, switch arms and repeat the movement.  Variations: You can also do this movement with two arms at a time, one on each knee, or using a barbell.",
    "thumbnail": "https://i.ytimg.com/vi/3VLTzIrnb5g/hq720.jpg",
    "kcal": 103,
    "duration": 18,
    "level": "Beginner",
    "video": "https://www.youtube.com/watch?v=3VLTzIrnb5g"
  },
  {
    "name": "Seated Palms-Down Barbell Wrist Curl",
    "type": "strength",
    "muscle": "arm",
    "equipment": "None",
    "instructions": "Hold a barbell with both hands and your palms facing down; hands spaced about shoulder width. Place your feet flat on the floor, at a distance that is slightly wider than shoulder width apart. Lean forward and place your forearms on top of your upper thighs with your palms down. Tip: Make sure that the back of the wrists lay on top of your knees. This will be your starting position. Lower the bar as far as possible while inhaling and keeping a tight grip. Now curl bar up as high as possible while flexing the forearms and exhaling. Hold the contraction at the top for a second and Tip: Only the wrist should move.  Variations: This exercise can also be done with one or two dumbbells. Alternatively an EZ bar can also be used.",
    "thumbnail": "https://i.ytimg.com/vi/3VLTzIrnb5g/hq720.jpg",
    "kcal": 75,
    "duration": 14,
    "level": "Intermediate",
    "video": "https://www.youtube.com/watch?v=3VLTzIrnb5g"
  },
  {
    "name": "Dumbbell Lying Supination",
    "type": "strength",
    "muscle": "arm",
    "equipment": "None",
    "instructions": "Lie sideways on a flat bench with one arm holding a dumbbell and the other hand on top of the bench folded so that you can rest your head on it. Bend the elbows of the arm holding the dumbbell so that it creates a 90-degree angle between the upper arm and the forearm. Now raise the upper arm so that the forearm is parallel to the floor and perpendicular to your torso (Tip: So the forearm will be directly in front of you). The upper arm will be stationary by your torso and should be parallel to the floor (aligned with your torso at all times). This will be your starting position. As you breathe out, externally rotate your forearm so that the dumbbell is lifted up in a semicircle motion as you maintain the 90 degree angle bend between the upper arms and the forearm. You will continue this external rotation until the forearm is perpendicular to the floor and the torso pointing towards the ceiling. At this point you will hold the contraction for a second. As you breathe in, slowly go back to the starting position. Repeat for the recommended amount of repetitions and then switch to the other arm.  Caution: There is no need to go heavy with this exercise. Too much weight will cause rotator cuff injury. Variations: You can perform this exercise standing and with cables.",
    "thumbnail": "https://i.ytimg.com/vi/Moq6yFCg0vc/hq720.jpg",
    "kcal": 69,
    "duration": 10,
    "level": "Intermediate",
    "video": "https://www.youtube.com/watch?v=Moq6yFCg0vc"
  },
  {
    "name": "Dumbbell Lying Pronation",
    "type": "strength",
    "muscle": "arm",
    "equipment": "None",
    "instructions": "Lie on a flat bench face down with one arm holding a dumbbell and the other hand on top of the bench folded so that you can rest your head on it. Bend the elbows of the arm holding the dumbbell so that it creates a 90-degree angle between the upper arm and the forearm. Now raise the upper arm so that the forearm is perpendicular to the floor and the upper arm is perpendicular to your torso. Tip: The upper arm should be parallel to the floor and also creating a 90-degree angle with your torso. This will be your starting position. As you breathe out, externally rotate your forearm so that the dumbbell is lifted forward as you maintain the 90 degree angle bend between the upper arms and the forearm. You will continue this external rotation until the forearm is parallel to the floor. At this point you will hold the contraction for a second. As you breathe in, slowly go back to the starting position. Repeat for the recommended amount of repetitions.  Caution: There is no need to go heavy with this exercise. Too much weight will cause rotator cuff injury. Variations: This exercise can be performed standing.",
    "thumbnail": "https://i.ytimg.com/vi/icoe6C2E-aY/hq720.jpg",
    "kcal": 112,
    "duration": 26,
    "level": "Intermediate",
    "video": "https://www.youtube.com/watch?v=icoe6C2E-aY"
  },
  {
    "name": "Seated palms-up wrist curl",
    "type": "strength",
    "muscle": "arm",
    "equipment": "barbell",
    "instructions": "Hold a barbell with both hands and your palms facing up; hands spaced about shoulder width. Place your feet flat on the floor, at a distance that is slightly wider than shoulder width apart. Lean forward and place your forearms on top of your upper thighs with your palms up. Tip: Make sure that the front of the wrists lay on top of your knees. This will be your starting position. Lower the bar as far as possible while inhaling and keeping a tight grip. Now curl bar up as high as possible while flexing the forearms and exhaling. Hold the contraction at the top for a second and Tip: Only the wrist should move.  Variations: This exercise can also be done with one or two dumbbells. Alternatively an EZ bar can also be used.",
    "thumbnail": "https://i.ytimg.com/vi/3VLTzIrnb5g/hq720.jpg",
    "kcal": 93,
    "duration": 30,
    "level": "Intermediate",
    "video": "https://www.youtube.com/watch?v=3VLTzIrnb5g"
  },
  {
    "name": "Palms-Up Dumbbell Wrist Curl Over A Bench",
    "type": "strength",
    "muscle": "arm",
    "equipment": "dumbbell",
    "instructions": "Start out by placing two dumbbells on one side of a flat bench. Kneel down on both of your knees so that your body is facing the flat bench. Use your arms to grab both of the dumbbells with a supinated grip (palms up) and bring them up so that your forearms are resting against the flat bench. Your wrists should be hanging over the edge. Start out by curling your wrist upwards and exhaling. Slowly lower your wrists back down to the starting position while inhaling. Make sure to inhale during this part of the exercise. Your forearms should be stationary as your wrist is the only movement needed to perform this exercise. Repeat for the recommended amount of repetitions.  Variations:  This exercise can also be performed sitting down by using your thighs as a resting position for your forearms. Your wrist can hang over your knees and the same movements as mentioned above can be performed. You can also use a barbell instead of a dumbbell.",
    "thumbnail": "https://i.ytimg.com/vi/O5wVOSnyV7M/hq720.jpg",
    "kcal": 91,
    "duration": 23,
    "level": "Beginner",
    "video": "https://www.youtube.com/watch?v=O5wVOSnyV7M"
  },
  {
    "name": "Standing Olympic Plate Hand Squeeze",
    "type": "strength",
    "muscle": "arm",
    "equipment": "other",
    "instructions": "To begin, stand straight while holding a weight plate by the ridge at arm's length in each hand using a neutral grip (palms facing in). You feet should be shoulder width apart from each other. This will be your starting position. Lower the plates until the fingers are nearly extended but can still hold weights. Inhale as you lower the plates. Now raise the plates back to the starting position as you exhale by closing your hands. Repeat for the recommended amount of repetitions prescribed in your program.  Variations: You can do both hands at the same time, alternate, or do one hand at a time.",
    "thumbnail": "https://i.ytimg.com/vi/BjsgeVZyE4U/hq720.jpg",
    "kcal": 68,
    "duration": 15,
    "level": "Beginner",
    "video": "https://www.youtube.com/shorts/BjsgeVZyE4U"
  },
  {
    "name": "Seated palms-down wrist curl",
    "type": "strength",
    "muscle": "arm",
    "equipment": "dumbbell",
    "instructions": "Start out by placing two dumbbells on the floor in front of a flat bench. Sit down on the edge of the flat bench with your legs at about shoulder width apart. Make sure to keep your feet on the floor. Use your arms to grab both of the dumbbells and bring them up so that your forearms are resting against your thighs with the palms of the hands facing down. Your wrists should be hanging over the edge of your thighs. Start out by curling your wrist upwards and exhaling. Slowly lower your wrists back down to the starting position while inhaling. Make sure to inhale during this part of the exercise. Tip: Your forearms should be stationary as your wrist is the only movement needed to perform this exercise. Repeat for the recommended amount of repetitions. When finished, simply lower the dumbbells to the floor.  Variations:  This exercise can also be performed using a barbell instead of a dumbbell. You can also focus on one arm at a time to isolate the forearms.",
    "thumbnail": "https://i.ytimg.com/vi/3VLTzIrnb5g/hq720.jpg",
    "kcal": 88,
    "duration": 28,
    "level": "Beginner",
    "video": "https://www.youtube.com/watch?v=3VLTzIrnb5g"
  },
  {
    "name": "Palms-Down Dumbbell Wrist Curl Over A Bench",
    "type": "strength",
    "muscle": "arm",
    "equipment": "dumbbell",
    "instructions": "Start out by placing two dumbbells on one side of a flat bench. Kneel down on both of your knees so that your body is facing the flat bench. Use your arms to grab both of the dumbbells with a pronated grip (palms facing down) and bring them up so that your forearms are resting against the flat bench. Your wrists should be hanging over the edge. Start out by curling your wrist upwards and exhaling. Slowly lower your wrists back down to the starting position while inhaling. Your forearms should be stationary as your wrist is the only movement needed to perform this exercise. Repeat for the recommended amount of repetitions.  Variations:  This exercise can also be performed sitting down by using your thighs as a resting position for your forearms. Your wrist can hang over your knees and the same movements as mentioned above can be performed. You can also use a barbell instead of a dumbbell.",
    "thumbnail": "https://i.ytimg.com/vi/jtQslxR3f0A/hq720.jpg",
    "kcal": 148,
    "duration": 25,
    "level": "Beginner",
    "video": "https://www.youtube.com/watch?v=jtQslxR3f0A"
  },
  {
    "name": "Seated One-Arm Dumbbell Palms-Down Wrist Curl",
    "type": "strength",
    "muscle": "arm",
    "equipment": "dumbbell",
    "instructions": "Sit on a flat bench with a dumbbell in your right hand. Place your feet flat on the floor, at a distance that is slightly wider than shoulder width apart. Lean forward and place your right forearm on top of your upper right thigh with your palm down. Tip: Make sure that the back of the wrist lies on top of your knees. This will be your starting position. Lower the dumbbell as far as possible as you keep a tight grip on the dumbbell. Inhale as you perform this movement. Now curl the dumbbell as high as possible as you contract the forearms and as you exhale. Keep the contraction for a second before you lower again. Tip: The only movement should happen at the wrist. Perform for the recommended amount of repetitions, switch arms and repeat the movement.  Variations: You can also do this movement with two arms at a time, one on each knee, or using a barbell.",
    "thumbnail": "https://i.ytimg.com/vi/3VLTzIrnb5g/hq720.jpg",
    "kcal": 59,
    "duration": 11,
    "level": "Beginner",
    "video": "https://www.youtube.com/watch?v=3VLTzIrnb5g"
  },
  {
    "name": "Triceps dip",
    "type": "strength",
    "muscle": "arm",
    "equipment": "body_only",
    "instructions": "To get into the starting position, hold your body at arm's length with your arms nearly locked above the bars. Now, inhale and slowly lower yourself downward. Your torso should remain upright and your elbows should stay close to your body. This helps to better focus on tricep involvement. Lower yourself until there is a 90 degree angle formed between the upper arm and forearm. Then, exhale and push your torso back up using your triceps to bring your body back to the starting position. Repeat the movement for the prescribed amount of repetitions.  Variations: If you are new at this exercise and do not have the strength to perform it, use a dip assist machine if available. These machines use weight to help you push your bodyweight. Otherwise, a spotter holding your legs can help. More advanced lifters can add weight to the exercise by using a weight belt that allows the addition of weighted plates.",
    "thumbnail": "https://i.ytimg.com/vi/6kALZikXxLc/hq720.jpg",
    "kcal": 83,
    "duration": 30,
    "level": "Intermediate",
    "video": "https://www.youtube.com/watch?v=6kALZikXxLc"
  },
  {
    "name": "Decline EZ-bar skullcrusher",
    "type": "strength",
    "muscle": "arm",
    "equipment": "e-z_curl_bar",
    "instructions": "Secure your legs at the end of the decline bench and slowly lay down on the bench. Using a close grip (a grip that is slightly less than shoulder width), lift the EZ bar from the rack and hold it straight over you with your arms locked and elbows in. The arms should be perpendicular to the floor. This will be your starting position. Tip: In order to protect your rotator cuff, it is best if you have a spotter help you lift the barbell off the rack. As you breathe in and you keep the upper arms stationary, bring the bar down slowly by moving your forearms in a semicircular motion towards you until you feel the bar slightly touch your forehead. Breathe in as you perform this portion of the movement. Lift the bar back to the starting position by contracting the triceps and exhaling. Repeat until the recommended amount of repetitions is performed.  Variations: You can use a straight bar or dumbbells to perform this movement. You can also perform it on a flat bench as well.",
    "thumbnail": "https://i.ytimg.com/vi/OpRLGph7El8/hq720.jpg",
    "kcal": 117,
    "duration": 15,
    "level": "Intermediate",
    "video": "https://www.youtube.com/watch?v=OpRLGph7El8"
  },
  {
    "name": "Dumbbell floor press",
    "type": "powerlifting",
    "muscle": "arm",
    "equipment": "dumbbell",
    "instructions": "Lay on the floor holding dumbbells in your hands. Your knees can be bent. Begin with the weights fully extended above you. Lower the weights until your upper arm comes in contact with the floor. You can tuck your elbows to emphasize triceps size and strength, or to focus on your chest angle your arms to the side. Pause at the bottom, and then bring the weight together at the top by extending through the elbows.",
    "thumbnail": "https://i.ytimg.com/vi/lNdi7VEf2Ew/hq720.jpg",
    "kcal": 83,
    "duration": 11,
    "level": "Intermediate",
    "video": "https://www.youtube.com/watch?v=lNdi7VEf2Ew"
  },
  {
    "name": "Cable V-bar push-down",
    "type": "strength",
    "muscle": "arm",
    "equipment": "cable",
    "instructions": "Attach a V-Bar to a high pulley and grab with an overhand grip (palms facing down) at shoulder width. Standing upright with the torso straight and a very small inclination forward, bring the upper arms close to your body and perpendicular to the floor. The forearms should be pointing up towards the pulley as they hold the bar. The thumbs should be higher than the small finger. This is your starting position. Using the triceps, bring the bar down until it touches the front of your thighs and the arms are fully extended perpendicular to the floor. The upper arms should always remain stationary next to your torso and only the forearms should move. Exhale as you perform this movement. After a second hold at the contracted position, bring the V-Bar slowly up to the starting point. Breathe in as you perform this step. Repeat for the recommended amount of repetitions.  Variations: There are many variations to this movement. For instance you can use an E-Z bar attachment as well as a straight cable bar attachment for different variations of the exercise. Also, you can attach a rope to the pulley as well as using a reverse grip on the bar exercises. Just like the Triceps Pushdown but with the V-Bar attachment.",
    "thumbnail": "https://i.ytimg.com/vi/8BXNngvMVdM/hq720.jpg",
    "kcal": 104,
    "duration": 12,
    "level": "Intermediate",
    "video": "https://www.youtube.com/watch?v=8BXNngvMVdM"
  },
  {
    "name": "Weighted bench dip",
    "type": "strength",
    "muscle": "arm",
    "equipment": "body_only",
    "instructions": "For this exercise you will need to place a bench behind your back and another one in front of you. With the benches perpendicular to your body, hold on to one bench on its edge with the hands close to your body, separated at shoulder width. Your arms should be fully extended. The legs will be extended forward on top of the other bench. Your legs should be parallel to the floor while your torso is to be perpendicular to the floor. Have your partner place the dumbbell on your lap. Note: This exercise is best performed with a partner as placing the weight on your lap can be challenging and cause injury without assistance. This will be your starting position. Slowly lower your body as you inhale by bending at the elbows until you lower yourself far enough to where there is an angle slightly smaller than 90 degrees between the upper arm and the forearm. Tip: Keep the elbows as close as possible throughout the movement. Forearms should always be pointing down. Using your triceps to bring your torso up again, lift yourself back to the starting position while exhaling. Repeat for the recommended amount of repetitions.  Caution: By placing your legs on top of another flat bench in front of you, the exercise becomes more challenging. It is best to attempt this exercise without any weights at first in order to get used to the movements required for good form. If that variation also becomes easy, then you can have a partner place plates on top of your lap. Make sure that in this case the partner ensures that the weights stay there throughout the movement.",
    "thumbnail": "https://i.ytimg.com/vi/HEeT2sbmcXc/hqdefault.jpg",
    "kcal": 91,
    "duration": 13,
    "level": "Intermediate",
    "video": "https://www.youtube.com/watch?v=HEeT2sbmcXc"
  },
  {
    "name": "EZ-Bar Skullcrusher",
    "type": "strength",
    "muscle": "arm",
    "equipment": "e-z_curl_bar",
    "instructions": "Using a close grip, lift the EZ bar and hold it with your elbows in as you lie on the bench. Your arms should be perpendicular to the floor. This will be your starting position. Keeping the upper arms stationary, lower the bar by allowing the elbows to flex. Inhale as you perform this portion of the movement. Pause once the bar is directly above the forehead. Lift the bar back to the starting position by extending the elbow and exhaling. Repeat.",
    "thumbnail": "https://i.ytimg.com/vi/jR7Y5YcugYc/hq720.jpg",
    "kcal": 139,
    "duration": 22,
    "level": "Intermediate",
    "video": "https://www.youtube.com/watch?v=jR7Y5YcugYc"
  },
  {
    "name": "Reverse Grip Triceps Pushdown",
    "type": "strength",
    "muscle": "arm",
    "equipment": "cable",
    "instructions": "Start by setting a bar attachment (straight or e-z) on a high pulley machine. Facing the bar attachment, grab it with the palms facing up (supinated grip) at shoulder width. Lower the bar by using your lats until your arms are fully extended by your sides. Tip: Elbows should be in by your sides and your feet should be shoulder width apart from each other. This is the starting position. Slowly elevate the bar attachment up as you inhale so it is aligned with your chest. Only the forearms should move and the elbows/upper arms should be stationary by your side at all times. Then begin to lower the cable bar back down to the original staring position while exhaling and contracting the triceps hard. Repeat for the recommended amount of repetitions.  Variation: This exercise can also be performed with a single handle using one arm at a time. This will allow you to better isolate the triceps. With this version you can self spot yourself by placing your hand over your forearm and applying some pressure to help you perform more reps than before.",
    "thumbnail": "https://i.ytimg.com/vi/SlBWbiL1eRg/hq720.jpg",
    "kcal": 114,
    "duration": 19,
    "level": "Intermediate",
    "video": "https://www.youtube.com/watch?v=SlBWbiL1eRg"
  },
  {
    "name": "Push-Ups - Close Triceps Position",
    "type": "strength",
    "muscle": "arm",
    "equipment": "body_only",
    "instructions": "Lie on the floor face down and place your hands closer than shoulder width for a close hand position. Make sure that you are holding your torso up at arms' length. Lower yourself until your chest almost touches the floor as you inhale. Using your triceps and some of your pectoral muscles, press your upper body back up to the starting position and squeeze your chest. Breathe out as you perform this step. After a second pause at the contracted position, repeat the movement for the prescribed amount of repetitions.  Variations:  If you are new at this exercise and do not have the strength to perform it, you can either bend your legs at the knees to take off resistance or perform the exercise against the wall instead of the floor. For the most advanced lifters, you can place your feet at a high surface such as a bench in order to increase the resistance.  See Also: Push-Up",
    "thumbnail": "https://i.ytimg.com/vi/aWixj7ey758/hqdefault.jpg",
    "kcal": 67,
    "duration": 13,
    "level": "Intermediate",
    "video": "https://www.youtube.com/watch?v=aWixj7ey758"
  },
  {
    "name": "Kneeling cable triceps extension",
    "type": "strength",
    "muscle": "arm",
    "equipment": "cable",
    "instructions": "Place a bench sideways in front of a high pulley machine. Hold a straight bar attachment above your head with your hands about 6 inches apart with your palms facing down. Face away from the machine and kneel. Place your head and the back of your upper arms on the bench. Your elbows should be bent with the forearms pointing towards the high pulley. This will be your starting position. While keeping your upper arms close to your head at all times with the elbows in, press the bar out in a semicircular motion until the elbows are locked and your arms are parallel to the floor. Contract the triceps hard and keep this position for a second. Exhale as you perform this movement. Slowly return to the starting position as you breathe in. Repeat for the recommended amount of repetitions.  Variation: You can also perform this exercise with exercise bands.",
    "thumbnail": "https://i.ytimg.com/vi/a1aoChl_ym4/hqdefault.jpg",
    "kcal": 75,
    "duration": 17,
    "level": "Intermediate",
    "video": "https://www.youtube.com/watch?v=a1aoChl_ym4"
  },
  {
    "name": "Single-arm cable triceps extension",
    "type": "strength",
    "muscle": "arm",
    "equipment": "cable",
    "instructions": "With your right hand, grasp a single handle attached to the high-cable pulley using a supinated (underhand; palms facing up) grip. You should be standing directly in front of the weight stack. Now pull the handle down so that your upper arm and elbow are locked in to the side of your body. Your upper arm and forearm should form an acute angle (less than 90-degrees). You can keep the other arm by the waist and you can have one leg in front of you and the other one back for better balance. This will be your starting position. As you contract the triceps, move the single handle attachment down to your side until your arm is straight. Breathe out as you perform this movement. Tip: Only the forearms should move. Your upper arms should remain stationary at all times. Squeeze the triceps and hold for a second in this contracted position. Slowly return the handle to the starting position. Repeat for the recommended amount of repetitions and then perform the same movement with the other arm.  Variations: You can use exercise bands to perform this exercise.",
    "thumbnail": "https://i.ytimg.com/vi/vjOefY0qd1Y/hq720.jpg",
    "kcal": 81,
    "duration": 21,
    "level": "Intermediate",
    "video": "https://www.youtube.com/watch?v=vjOefY0qd1Y"
  },
  {
    "name": "Triceps Pushdown - Rope Attachment",
    "type": "strength",
    "muscle": "arm",
    "equipment": "None",
    "instructions": "Attach a rope attachment to a high pulley and grab with a neutral grip (palms facing each other). Standing upright with the torso straight and a very small inclination forward, bring the upper arms close to your body and perpendicular to the floor. The forearms should be pointing up towards the pulley as they hold the rope with the palms facing each other. This is your starting position. Using the triceps, bring the rope down as you bring each side of the rope to the side of your thighs. At the end of the movement the arms are fully extended and perpendicular to the floor. The upper arms should always remain stationary next to your torso and only the forearms should move. Exhale as you perform this movement. After holding for a second, at the contracted position, bring the rope slowly up to the starting point. Breathe in as you perform this step. Repeat for the recommended amount of repetitions.  Variations: There are many variations to this movement. For instance you can use an E-Z bar attachment as well as a V-angled bar or straight bar. Same as the Triceps Pushdown except with the rope attachment.",
    "thumbnail": "https://i.ytimg.com/vi/y6EdXBdL75A/hq720.jpg",
    "kcal": 63,
    "duration": 12,
    "level": "Intermediate",
    "video": "https://www.youtube.com/watch?v=y6EdXBdL75A"
  },
  {
    "name": "Seated triceps press",
    "type": "strength",
    "muscle": "arm",
    "equipment": "dumbbell",
    "instructions": "Sit down on a bench with back support and grasp a dumbbell with both hands and hold it overhead at arm's length. Tip: a better way is to have somebody hand it to you especially if it is very heavy. The resistance should be resting in the palms of your hands with your thumbs around it. The palm of the hand should be facing inward. This will be your starting position. Keeping your upper arms close to your head (elbows in) and perpendicular to the floor, lower the resistance in a semi-circular motion behind your head until your forearms touch your biceps. Tip: The upper arms should remain stationary and only the forearms should move. Breathe in as you perform this step. Go back to the starting position by using the triceps to raise the dumbbell. Breathe out as you perform this step. Repeat for the recommended amount of repetitions.  Variations:  You can perform this exercise standing as well but this puts strain on your back especially if you are using heavy dumbbells like 95 lbs or so. Another variation is to use an EZ or straight bar instead in which case you will be holding the bar from the inside (around 5 inches between both hands) with the palms facing forward (pronated grip). There is also a bar that has parallel bars inside (often referred to as a triceps blaster) and this can also be used for this exercise. Finally, a low pulley cable with a rope attachment or bar (straight or EZ) attachment at the end can be used for variety purposes as well.",
    "thumbnail": "https://i.ytimg.com/vi/YK6zrgVI4GI/hq720.jpg",
    "kcal": 136,
    "duration": 28,
    "level": "Intermediate",
    "video": "https://www.youtube.com/watch?v=YK6zrgVI4GI"
  },
  {
    "name": "Incline EZ-bar skullcrusher",
    "type": "strength",
    "muscle": "arm",
    "equipment": "barbell",
    "instructions": "Hold a barbell with an overhand grip (palms down) that is a little closer together than shoulder width. Lie back on an incline bench set at any angle between 45-75-degrees. Bring the bar overhead with your arms extended and elbows in. The arms should be in line with the torso above the head. This will be your starting position. Now lower the bar in a semicircular motion behind your head until your forearms touch your biceps. Inhale as you perform this movement. Tip: Keep your upper arms stationary and close to your head at all times. Only the forearms should move. Return to the starting position as you breathe out and you contract the triceps. Hold the contraction for a second. Repeat for the recommended amount of repetitions.  Variations: Can also be done with an e-z bar, with two dumbbells (using a pronated or supinated grip), seated or standing or with two dumbbells and your palms facing in.",
    "thumbnail": "https://i.ytimg.com/vi/kcvdV0LkhUk/hq720.jpg",
    "kcal": 109,
    "duration": 22,
    "level": "Intermediate",
    "video": "https://www.youtube.com/watch?v=kcvdV0LkhUk"
  },
  {
    "name": "Decline Close-Grip Bench To Skull Crusher",
    "type": "strength",
    "muscle": "arm",
    "equipment": "barbell",
    "instructions": "Secure your legs at the end of the decline bench and slowly lay down on the bench. Using a close grip (a grip that is slightly less than shoulder width), lift the bar from the rack and hold it straight over you with your arms locked and elbows in. The arms should be perpendicular to the floor. This will be your starting position. Tip: In order to protect your rotator cuff, it is best if you have a spotter help you lift the barbell off the rack. Now lower the bar down to your lower chest as you breathe in. Keep the elbows in as you perform this movement. Using the triceps to push the bar back up, press it back to the starting position as you exhale. As you breathe in and you keep the upper arms stationary, bring the bar down slowly by moving your forearms in a semicircular motion towards you until you feel the bar slightly touch your forehead. Breathe in as you perform this portion of the movement. Lift the bar back to the starting position by contracting the triceps and exhaling. Repeat steps 3-6 until the recommended amount of repetitions is performed.  Variations: You can use an e-z bar or dumbbells to perform this movement. You can also perform it on a flat bench as well.",
    "thumbnail": "https://i.ytimg.com/vi/Y4nEBlPxzp4/hq720.jpg",
    "kcal": 69,
    "duration": 11,
    "level": "Beginner",
    "video": "https://www.youtube.com/watch?v=Y4nEBlPxzp4"
  },
  {
    "name": "Tricep Dumbbell Kickback",
    "type": "strength",
    "muscle": "arm",
    "equipment": "dumbbell",
    "instructions": "Start with a dumbbell in each hand and your palms facing your torso. Keep your back straight with a slight bend in the knees and bend forward at the waist. Your torso should be almost parallel to the floor. Make sure to keep your head up. Your upper arms should be close to your torso and parallel to the floor. Your forearms should be pointed towards the floor as you hold the weights. There should be a 90-degree angle formed between your forearm and upper arm. This is your starting position. Now, while keeping your upper arms stationary, exhale and use your triceps to lift the weights until the arm is fully extended. Focus on moving the forearm. After a brief pause at the top contraction, inhale and slowly lower the dumbbells back down to the starting position. Repeat the movement for the prescribed amount of repetitions.  Variations: This exercise can be executed also one arm at a time much like the one arm rows are performed. Also, if you like the one arm variety, you can use a low pulley handle instead of a dumbbell for better peak contraction. In this case, the palms should be facing up (supinated grip) as opposed to the torso (neutral grip).",
    "thumbnail": "https://i.ytimg.com/vi/JPmbMOu4IYw/hq720.jpg",
    "kcal": 144,
    "duration": 10,
    "level": "Intermediate",
    "video": "https://www.youtube.com/watch?v=JPmbMOu4IYw"
  },
  {
    "name": "Dip Machine",
    "type": "strength",
    "muscle": "arm",
    "equipment": "cable",
    "instructions": "Sit securely in a dip machine, select the weight and firmly grasp the handles. Now keep your elbows in at your sides in order to place emphasis on the triceps. The elbows should be bent at a 90 degree angle. As you contract the triceps, extend your arms downwards as you exhale. Tip: At the bottom of the movement, focus on keeping a little bend in your arms to keep tension on the triceps muscle. Now slowly let your arms come back up to the starting position as you inhale. Repeat for the recommended amount of repetitions.  Variations: You can perform this exercise on parallel bars or on a triceps dip assist machine.",
    "thumbnail": "https://i.ytimg.com/vi/pMarNxAvHPc/hq720.jpg",
    "kcal": 122,
    "duration": 24,
    "level": "Intermediate",
    "video": "https://www.youtube.com/watch?v=pMarNxAvHPc"
  },
  {
    "name": "Standing Dumbbell Triceps Extension",
    "type": "strength",
    "muscle": "arm",
    "equipment": "dumbbell",
    "instructions": "Standing Dumbbell Triceps Extension",
    "thumbnail": "https://i.ytimg.com/vi/-Vyt2QdsR7E/hq720.jpg",
    "kcal": 138,
    "duration": 25,
    "level": "Intermediate",
    "video": "https://www.youtube.com/watch?v=-Vyt2QdsR7E"
  },
  {
    "name": "Parallel Bar Dip",
    "type": "strength",
    "muscle": "arm",
    "equipment": "body_only",
    "instructions": "Stand between a set of parallel bars. Place a hand on each bar, and then take a small jump to help you get into the starting position with your arms locked out. Begin by flexing the elbow, lowering your body until your arms break 90 degrees. Avoid swinging, and maintain good posture throughout the descent. Reverse the motion by extending the elbow, pushing yourself back up into the starting position. Repeat for the desired number of repetitions.",
    "thumbnail": "https://i.ytimg.com/vi/U7HeutDqS_w/hqdefault.jpg",
    "kcal": 136,
    "duration": 21,
    "level": "Intermediate",
    "video": "https://www.youtube.com/watch?v=U7HeutDqS_w"
  },
  {
    "name": "Ring dip",
    "type": "strength",
    "muscle": "arm",
    "equipment": "body_only",
    "instructions": "Grip a ring in each hand, and then take a small jump to help you get into the starting position with your arms locked out. Begin by flexing the elbow, lowering your body until your arms break 90 degrees. Avoid swinging, and maintain good posture throughout the descent. Reverse the motion by extending the elbow, pushing yourself back up into the starting position. Repeat for the desired number of repetitions.",
    "thumbnail": "https://i.ytimg.com/vi/4dX_vlGlW0A/hqdefault.jpg",
    "kcal": 94,
    "duration": 23,
    "level": "Intermediate",
    "video": "https://www.youtube.com/watch?v=4dX_vlGlW0A"
  }
]
