[
  {
    "name": "Smith machine shrug",
    "type": "strength",
    "muscle": "shoulder",
    "equipment": "machine",
    "instructions": "To begin, set the bar height on the smith machine around the middle of your thighs. Once the correct height is chosen and the bar is loaded, grab the bar using a pronated grip (palms facing you) shoulder width apart from each other. Lift the barbell up and fully extend your arms with your back straight. This is the starting position. While exhaling, elevate the bar by raising your shoulders until they come close to touching your ears. Hold the contraction for a second before lowering the bar back down to the starting position while inhaling. Repeat for the recommended amount of repetitions.  Variations:  This exercise can be performed using a squat rack with a barbell. However, be careful not to select a weight that is so heavy that it causes you to break good form as you do not have the support of the smith machine for this variation. Too much weight can harm your back. You can also use dumbbells to perform this exercise.",
    "thumbnail": "https://i.ytimg.com/vi/u4aiG-KFWrc/hq720.jpg",
    "kcal": 125,
    "duration": 19,
    "level": "Intermediate",
    "video": "https://www.youtube.com/watch?v=u4aiG-KFWrc"
  },
  {
    "name": "Leverage Shrug",
    "type": "strength",
    "muscle": "shoulder",
    "equipment": "machine",
    "instructions": "Load the pins to an appropriate weight. Position yourself directly between the handles. Grasp the top handles with a comfortable grip, and then lower your hips as you take a breath. Look forward with your head and keep your chest up. Drive through the floor with your heels, extending your hips and knees as you rise to a standing position. Keep your arms straight throughout the movement, finishing with your shoulders back. This will be your starting position. Raise the weight by shrugging the shoulders towards your ears, moving straight up and down. Pause at the top of the motion, and then return the weight to the starting position.",
    "thumbnail": "https://i.ytimg.com/vi/5f0GAGNtCCI/hq720.jpg",
    "kcal": 58,
    "duration": 26,
    "level": "Intermediate",
    "video": "https://www.youtube.com/watch?v=5f0GAGNtCCI"
  },
  {
    "name": "Standing dumbbell shrug",
    "type": "strength",
    "muscle": "shoulder",
    "equipment": "dumbbell",
    "instructions": "Stand erect with a dumbbell on each hand (palms facing your torso), arms extended on the sides. Lift the dumbbells by elevating the shoulders as high as possible while you exhale. Hold the contraction at the top for a second. Tip: The arms should remain extended at all times. Refrain from using the biceps to help lift the dumbbells. Only the shoulders should be moving up and down. Lower the dumbbells back to the original position. Repeat for the recommended amount of repetitions.  Variations: You can perform this exercise with bands, barbells or cables. You can also use a single handle and work one side at a time.",
    "thumbnail": "https://i.ytimg.com/vi/9LNcILnLRZk/hq720.jpg",
    "kcal": 90,
    "duration": 12,
    "level": "Intermediate",
    "video": "https://www.youtube.com/watch?v=9LNcILnLRZk"
  },
  {
    "name": "Standing dumbbell upright row",
    "type": "strength",
    "muscle": "shoulder",
    "equipment": "dumbbell",
    "instructions": "Grasp a dumbbell in each hand with a pronated (palms forward) grip that is slightly less than shoulder width. The dumbbells should be resting on top of your thighs. Your arms should be extended with a slight bend at the elbows and your back should be straight. This will be your starting position. Use your side shoulders to lift the dumbbells as you exhale. The dumbbells should be close to the body as you move it up and the elbows should drive the motion. Continue to lift them until they nearly touch your chin. Tip: Your elbows should drive the motion. As you lift the dumbbells, your elbows should always be higher than your forearms. Also, keep your torso stationary and pause for a second at the top of the movement. Lower the dumbbells back down slowly to the starting position. Inhale as you perform this portion of the movement. Repeat for the recommended amount of repetitions.  Caution: Be very careful with how much weight you use in this exercise. Too much weight leads to bad form, which in turn can cause shoulder injury. I've seen this too many times so please no jerking, swinging and cheating. Also, if you suffer from shoulder problems, you may want to stay away from upright rows and substitute by some form of lateral raises. Variations: This exercise can also be performed using a straight bar attached to a low pulley and it can also be performed using an e-z bar.",
    "thumbnail": "https://i.ytimg.com/vi/SO_nHq52a8o/hq720.jpg",
    "kcal": 123,
    "duration": 19,
    "level": "Intermediate",
    "video": "https://www.youtube.com/watch?v=SO_nHq52a8o"
  },
  {
    "name": "Kettlebell sumo deadlift high pull",
    "type": "strength",
    "muscle": "shoulder",
    "equipment": "kettlebells",
    "instructions": "Place a kettlebell on the ground between your feet. Position your feet in a wide stance, and grasp the kettlebell with two hands. Set your hips back as far as possible, with your knees bent. Keep your chest and head up. This will be your starting position. Begin by extending the hips and knees, simultaneously pulling the kettlebell to your shoulders, raising your elbows as you do so. Reverse the motion to return to the starting position.",
    "thumbnail": "https://i.ytimg.com/vi/P6FmhYC3PYM/hq720.jpg",
    "kcal": 130,
    "duration": 22,
    "level": "Intermediate",
    "video": "https://www.youtube.com/watch?v=P6FmhYC3PYM"
  },
  {
    "name": "Calf-Machine Shoulder Shrug",
    "type": "strength",
    "muscle": "shoulder",
    "equipment": "machine",
    "instructions": "Position yourself on the calf machine so that the shoulder pads are above your shoulders. Your torso should be straight with the arms extended normally by your side. This will be your starting position. Raise your shoulders up towards your ears as you exhale and hold the contraction for a full second. Slowly return to the starting position as you inhale. Repeat for the recommended amount of repetitions.  Variations: You can use dumbbells, barbells, smith machines and pulley machines to perform shrugging motions.",
    "thumbnail": "https://i.ytimg.com/vi/8Qla9t5I8rc/hq720.jpg",
    "kcal": 150,
    "duration": 14,
    "level": "Beginner",
    "video": "https://www.youtube.com/watch?v=8Qla9t5I8rc"
  },
  {
    "name": "Barbell shrug",
    "type": "strength",
    "muscle": "shoulder",
    "equipment": "barbell",
    "instructions": "Stand up straight with your feet at shoulder width as you hold a barbell with both hands in front of you using a pronated grip (palms facing the thighs). Tip: Your hands should be a little wider than shoulder width apart. You can use wrist wraps for this exercise for a better grip. This will be your starting position. Raise your shoulders up as far as you can go as you breathe out and hold the contraction for a second. Tip: Refrain from trying to lift the barbell by using your biceps. Slowly return to the starting position as you breathe in. Repeat for the recommended amount of repetitions.  Variations: You can also rotate your shoulders as you go up, going in a semicircular motion from front to rear. However this version is not good for people with shoulder problems. In addition, this exercise can be performed with the barbell behind the back, with dumbbells by the side, a smith machine or with a shrug machine.",
    "thumbnail": "https://i.ytimg.com/vi/9xGqgGFAtiM/hq720.jpg",
    "kcal": 112,
    "duration": 24,
    "level": "Intermediate",
    "video": "https://www.youtube.com/watch?v=9xGqgGFAtiM"
  },
  {
    "name": "Barbell behind-the-back shrug",
    "type": "strength",
    "muscle": "shoulder",
    "equipment": "barbell",
    "instructions": "Stand up straight with your feet at shoulder width as you hold a barbell with both hands behind your back using a pronated grip (palms facing back). Tip: Your hands should be a little wider than shoulder width apart. You can use wrist wraps for this exercise for better grip. This will be your starting position. Raise your shoulders up as far as you can go as you breathe out and hold the contraction for a second. Tip: Refrain from trying to lift the barbell by using your biceps. The arms should remain stretched out at all times. Slowly return to the starting position as you breathe in. Repeat for the recommended amount of repetitions.  Variations: You can also rotate your shoulders as you go up, going in a semicircular motion from rear to front. However this version is not good for people with shoulder problems. In addition, this exercise can be performed with the barbell in front of your thighs, with dumbbells by the side, a smith machine or with a shrug machine.",
    "thumbnail": "https://i.ytimg.com/vi/OoUQRw91D94/hqdefault.jpg",
    "kcal": 124,
    "duration": 23,
    "level": "Intermediate",
    "video": "https://www.youtube.com/watch?v=OoUQRw91D94"
  },
  {
    "name": "Cable straight-bar upright row",
    "type": "strength",
    "muscle": "shoulder",
    "equipment": "cable",
    "instructions": "Grasp a straight bar cable attachment that is attached to a low pulley with a pronated (palms facing your thighs) grip that is slightly less than shoulder width. The bar should be resting on top of your thighs. Your arms should be extended with a slight bend at the elbows and your back should be straight. This will be your starting position. Use your side shoulders to lift the cable bar as you exhale. The bar should be close to the body as you move it up. Continue to lift it until it nearly touches your chin. Tip: Your elbows should drive the motion. As you lift the bar, your elbows should always be higher than your forearms. Also, keep your torso stationary and pause for a second at the top of the movement. Lower the bar back down slowly to the starting position. Inhale as you perform this portion of the movement. Repeat for the recommended amount of repetitions.  Caution: Be very careful with how much weight you use in this exercise. Too much weight leads to bad form, which in turn can cause shoulder injury. I've seen this too many times so please no jerking, swinging and cheating. Also, if you suffer from shoulder problems, you may want to stay away from upright rows and substitute by some form of lateral raises. Variations: This exercise can also be performed using a straight or e-z bar. Another variation is to use dumbbells, though this later exercise should be reserved by the most advanced people that are well familiarized with correct execution.",
    "thumbnail": "https://i.ytimg.com/vi/WNz7O59GORA/hq720.jpg",
    "kcal": 72,
    "duration": 10,
    "level": "Intermediate",
    "video": "https://www.youtube.com/watch?v=WNz7O59GORA"
  },
  {
    "name": "Cable shrug",
    "type": "strength",
    "muscle": "shoulder",
    "equipment": "cable",
    "instructions": "Grasp a cable bar attachment that is attached to a low pulley with a shoulder width or slightly wider overhand (palms facing down) grip. Stand erect close to the pulley with your arms extended in front of you holding the bar. This will be your starting position. Lift the bar by elevating the shoulders as high as possible as you exhale. Hold the contraction at the top for a second. Tip: The arms should remain extended at all times. Refrain from using the biceps to help lift the bar. Only the shoulders should be moving up and down. Lower the bar back to the original position. Repeat for the recommended amount of repetitions.  Variations: You can perform this exercise with bands, barbells or dumbbell. You can also use a single handle and work one side at a time.",
    "thumbnail": "https://i.ytimg.com/vi/Wab3-dsZohU/hq720.jpg",
    "kcal": 109,
    "duration": 16,
    "level": "Intermediate",
    "video": "https://www.youtube.com/watch?v=Wab3-dsZohU"
  },
  {
    "name": "Smith machine behind-the-back shrug",
    "type": "strength",
    "muscle": "shoulder",
    "equipment": "machine",
    "instructions": "With the bar at thigh level, load an appropriate weight. Stand with the bar behind you, taking a shoulder-width, pronated grip on the bar and unhook the weight. You should be standing up straight with your head and chest up and your arms extended. This will be your starting position. Initiate the movement by shrugging your shoulders straight up. Do not flex the arms or wrist during the movement. After a brief pause return the weight to the starting position. Repeat for the desired number of repetitions before engaging the hooks to rack the weight.",
    "thumbnail": "https://i.ytimg.com/vi/keNpoJVJCNk/hq720.jpg",
    "kcal": 65,
    "duration": 30,
    "level": "Intermediate",
    "video": "https://www.youtube.com/watch?v=keNpoJVJCNk"
  },
  {
    "name": "Upright Row - With Bands",
    "type": "strength",
    "muscle": "shoulder",
    "equipment": "bands",
    "instructions": "To begin, stand on an exercise band so that tension begins at arm's length. Grasp the handles using a pronated (palms facing your thighs) grip that is slightly less than shoulder width. The handles should be resting on top of your thighs. Your arms should be extended with a slight bend at the elbows and your back should be straight. This will be your starting position. Use your side shoulders to lift the handles as you exhale. The handles should be close to the body as you move them up. Continue to lift the handles until they nearly touches your chin. Tip: Your elbows should drive the motion. As you lift the handles, your elbows should always be higher than your forearms. Also, keep your torso stationary and pause for a second at the top of the movement. Lower the handles back down slowly to the starting position. Inhale as you perform this portion of the movement. Repeat for the recommended amount of repetitions.  Variations: This exercise can also be performed using a straight or e-z bar. Another variation is to use dumbbells, though this later exercise should be reserved by the most advanced people that are well familiarized with correct execution.",
    "thumbnail": "https://i.ytimg.com/vi/bfzl23IIOi8/hq720.jpg",
    "kcal": 136,
    "duration": 12,
    "level": "Beginner",
    "video": "https://www.youtube.com/watch?v=bfzl23IIOi8"
  },
  {
    "name": "Smith machine upright row",
    "type": "strength",
    "muscle": "shoulder",
    "equipment": "machine",
    "instructions": "To begin, set the bar on the smith machine to a height that is around the middle of your thighs. Once the correct height is chosen and the bar is loaded, grasp the bar using a pronated (palms forward) grip that is shoulder width apart. You may need some wrist wraps if using a significant amount of weight. Lift the barbell up and fully extend your arms with your back straight. There should be a slight bend at the elbows. This is the starting position. Use your side shoulders to lift the bar as you exhale. The bar should be close to the body as you move it up. Continue to lift it until it nearly touches your chin. Tip: Your elbows should drive the motion. As you lift the bar, your elbows should always be higher than your forearms. Also, keep your torso stationary and pause for a second at the top of the movement. Lower the bar back down slowly to the starting position. Inhale as you perform this portion of the movement. Repeat for the recommended amount of repetitions.  Caution: Be very careful with how much weight you use in this exercise. Too much weight leads to bad form, which in turn can cause shoulder injury. I've seen this too many times so please no jerking, swinging and cheating. Also, if you suffer from shoulder problems, you may want to stay away from upright rows and substitute by some form of lateral raises. Variations: This exercise can also be performed using a barbell, E-Z bar, straight bar attached to a low pulley and it can also be performed using dumbbells, though this later exercise should be reserved by the most advanced people that are well familiarized with correct execution. Same as the Upright Barbell Row but with a Smith Machine.",
    "thumbnail": "https://i.ytimg.com/vi/vcXkzN6QXbk/hq720.jpg",
    "kcal": 141,
    "duration": 13,
    "level": "Intermediate",
    "video": "https://www.youtube.com/watch?v=vcXkzN6QXbk"
  },
  {
    "name": "Clean Shrug",
    "type": "olympic_weightlifting",
    "muscle": "shoulder",
    "equipment": "barbell",
    "instructions": "Begin with a shoulder width, double overhand or hook grip, with the bar hanging at the mid thigh position. Your back should be straight and inclined slightly forward. Shrug your shoulders towards your ears. While this exercise can usually by loaded with heavier weight than a clean, avoid overloading to the point that the execution slows down.",
    "thumbnail": "https://i.ytimg.com/vi/aM64hKg9zxI/hq720.jpg",
    "kcal": 112,
    "duration": 29,
    "level": "Beginner",
    "video": "https://www.youtube.com/watch?v=aM64hKg9zxI"
  },
  {
    "name": "Scapular Pull-Up",
    "type": "strength",
    "muscle": "shoulder",
    "equipment": "none",
    "instructions": "Take a pronated grip on a pull-up bar. From a hanging position, raise yourself a few inches without using your arms. Do this by depressing your shoulder girdle in a reverse shrugging motion. Pause at the completion of the movement, and then slowly return to the starting position before performing more repetitions.",
    "thumbnail": "https://i.ytimg.com/vi/pE8PJsWEV7k/hq720.jpg",
    "kcal": 54,
    "duration": 25,
    "level": "Beginner",
    "video": "https://www.youtube.com/watch?v=pE8PJsWEV7k"
  },
  {
    "name": "Snatch Shrug",
    "type": "olympic_weightlifting",
    "muscle": "shoulder",
    "equipment": "barbell",
    "instructions": "Begin with a wide grip, with the bar hanging at the mid thigh position. You can use a hook or overhand grip. Your back should be straight and inclined slightly forward. Shrug your shoulders towards your ears. While this exercise can usually by loaded with heavier weight than a snatch, avoid overloading to the point that the execution slows down.",
    "thumbnail": "https://i.ytimg.com/vi/TOfpapB5wF8/hq720.jpg",
    "kcal": 83,
    "duration": 11,
    "level": "Beginner",
    "video": "https://www.youtube.com/watch?v=TOfpapB5wF8"
  }
]