[
  {
    "name": "Landmine twist",
    "type": "strength",
    "muscle": "stomach",
    "equipment": "other",
    "instructions": "Position a bar into a landmine or securely anchor it in a corner. Load the bar to an appropriate weight. Raise the bar from the floor, taking it to shoulder height with both hands with your arms extended in front of you. Adopt a wide stance. This will be your starting position. Perform the movement by rotating the trunk and hips as you swing the weight all the way down to one side. Keep your arms extended throughout the exercise. Reverse the motion to swing the weight all the way to the opposite side. Continue alternating the movement until the set is complete.",
    "thumbnail": "https://i.ytimg.com/vi/wpfYRQGYVm4/hq720.jpg",
    "kcal": 91,
    "duration": 18,
    "level": "Intermediate",
    "video": "https://www.youtube.com/watch?v=wpfYRQGYVm4"
  },
  {
    "name": "Elbow plank",
    "type": "strength",
    "muscle": "stomach",
    "equipment": "body_only",
    "instructions": "Get into a prone position on the floor, supporting your weight on your toes and your forearms. Your arms are bent and directly below the shoulder. Keep your body straight at all times, and hold this position as long as possible. To increase difficulty, an arm or leg can be raised.",
    "thumbnail": "https://i.ytimg.com/vi/pvIjsG5Svck/hq720.jpg",
    "kcal": 117,
    "duration": 24,
    "level": "Intermediate",
    "video": "https://www.youtube.com/watch?v=pvIjsG5Svck"
  },
  {
    "name": "Bottoms Up",
    "type": "strength",
    "muscle": "stomach",
    "equipment": "body_only",
    "instructions": "Begin by lying on your back on the ground. Your legs should be straight and your arms at your side. This will be your starting position. To perform the movement, tuck the knees toward your chest by flexing the hips and knees. Following this, extend your legs directly above you so that they are perpendicular to the ground. Rotate and elevate your pelvis to raise your glutes from the floor. After a brief pause, return to the starting position.",
    "thumbnail": "https://i.ytimg.com/vi/EJYHA6yJzNU/hq720_2.jpg",
    "kcal": 89,
    "duration": 22,
    "level": "Intermediate",
    "video": "https://www.youtube.com/shorts/EJYHA6yJzNU"
  },
  {
    "name": "Suspended ab fall-out",
    "type": "strength",
    "muscle": "stomach",
    "equipment": "other",
    "instructions": "Adjust the straps so the handles are at an appropriate height, below waist level. Begin standing and grasping the handles. Lean into the straps, moving to an incline push-up position. This will be your starting position. Keeping your arms straight, lean further into the suspension straps, bringing your body closer to the ground, allowing your shoulders to extend, raising your arms up and over your head. Maintain a neutral spine and keep the rest of your body straight, your shoulders being the only joints allowed to move. Pause during the peak contraction, and then return to the starting position.",
    "thumbnail": "https://i.ytimg.com/vi/0FAMdxWgFnA/hq720.jpg",
    "kcal": 89,
    "duration": 10,
    "level": "Intermediate",
    "video": "https://www.youtube.com/watch?v=0FAMdxWgFnA"
  },
  {
    "name": "Dumbbell V-Sit Cross Jab",
    "type": "strength",
    "muscle": "stomach",
    "equipment": "dumbbell",
    "instructions": "Begin seated on your butt with your knees bent and feet on the ground. Lean your upper body back to form a 45-degree angle with the floor. Bring your feet off the ground so that your body resembles a \"V\" shape. Grasp a dumbbell in each hand and hold tight to your chest with palms facing each other. This will be your starting position. While keeping your core tight and maintaining your body's \"V\" position, quickly extend your left arm straight out (similar to a jab) and then bring it back to the starting position while simultaneously punching out with the right arm. Your torso and legs may slightly rotate side to side opposite of your hands throughout the movement—this is okay. A punch with each hand counts as one total repetition. Repeat for recommended number of repetitions.",
    "thumbnail": "https://i.ytimg.com/vi/k4vFGA7qOb4/hq720.jpg",
    "kcal": 112,
    "duration": 10,
    "level": "Intermediate",
    "video": "https://www.youtube.com/watch?v=k4vFGA7qOb4"
  },
  {
    "name": "Standing cable low-to-high twist",
    "type": "strength",
    "muscle": "stomach",
    "equipment": "cable",
    "instructions": "Connect a standard handle on a tower, and move the cable to the lowest pulley position. With your side to the cable, grab the handle with one hand and step away from the tower. You should be approximately arm’s length away from the pulley, with the tension of the weight on the cable. Your outstretched arm should be aligned with the cable. With your feet positioned shoulder width apart, squat down and grab the handle with both hands. Your arms should still be fully extended. In one motion, pull the handle up and across your body until your arms are in a fully-extended position above your head. Keep your back straight and your arms close to your body as you pivot your back foot and straighten your legs to get a full range of motion. Retract your arms and then your body. Return to the neutral position in a slow and controlled manner. Repeat to failure. Then, reposition and repeat the same series of movements on the opposite side.  Tip: You will twist your entire body with this exercise, but focus on getting maximal torso rotation and a strong clinch at the end of the movement. To ensure a good mind-muscle connection, keep your abs tense at all times.",
    "thumbnail": "https://i.ytimg.com/vi/rHfjG2Oflz0/hqdefault.jpg",
    "kcal": 97,
    "duration": 20,
    "level": "Intermediate",
    "video": "https://www.youtube.com/watch?v=rHfjG2Oflz0"
  },
  {
    "name": "Dumbbell spell caster",
    "type": "strength",
    "muscle": "stomach",
    "equipment": "dumbbell",
    "instructions": "Hold a dumbbell in each hand with a pronated grip. Your feet should be wide with your hips and knees extended. This will be your starting position. Begin the movement by pulling both of the dumbbells to one side next to your hip, rotating your torso. Keeping your arms straight and the dumbbells parallel to the ground, rotate your torso to swing the weights to your opposite side. Continue alternating, rotating from one side to the other until the set is complete.",
    "thumbnail": "https://i.ytimg.com/vi/fxL497_e6WI/hq720.jpg",
    "kcal": 129,
    "duration": 19,
    "level": "Beginner",
    "video": "https://www.youtube.com/watch?v=fxL497_e6WI"
  },
  {
    "name": "Decline reverse crunch",
    "type": "strength",
    "muscle": "stomach",
    "equipment": "other",
    "instructions": "Lie on your back on a decline bench and hold on to the top of the bench with both hands. Don't let your body slip down from this position. Hold your legs parallel to the floor using your abs to hold them there while keeping your knees and feet together. Tip: Your legs should be fully extended with a slight bend on the knee. This will be your starting position. While exhaling, move your legs towards the torso as you roll your pelvis backwards and you raise your hips off the bench. At the end of this movement your knees will be touching your chest. Hold the contraction for a second and move your legs back to the starting position while inhaling. Repeat for the recommended amount of repetitions.  Variations: You can do the movement on a flat surface and as you get more advanced you can use ankle weights.",
    "thumbnail": "https://i.ytimg.com/vi/YcMj0EEadQo/hqdefault.jpg",
    "kcal": 130,
    "duration": 13,
    "level": "Intermediate",
    "video": "https://www.youtube.com/watch?v=YcMj0EEadQo"
  },
  {
    "name": "Spider crawl",
    "type": "strength",
    "muscle": "stomach",
    "equipment": "body_only",
    "instructions": "Begin in a prone position on the floor. Support your weight on your hands and toes, with your feet together and your body straight. Your arms should be bent to 90 degrees. This will be your starting position. Initiate the movement by raising one foot off of the ground. Externally rotate the leg and bring the knee toward your elbow, as far forward as possible. Return this leg to the starting position and repeat on the opposite side.",
    "thumbnail": "https://i.ytimg.com/vi/2Jczv6yuV_Y/hqdefault.jpg",
    "kcal": 113,
    "duration": 27,
    "level": "Intermediate",
    "video": "https://www.youtube.com/watch?v=2Jczv6yuV_Y"
  },
  {
    "name": "Cocoons",
    "type": "strength",
    "muscle": "stomach",
    "equipment": "body_only",
    "instructions": "Begin by lying on your back on the ground. Your legs should be straight and your arms extended behind your head. This will be your starting position. To perform the movement, tuck the knees toward your chest, rotating your pelvis to lift your glutes from the floor. As you do so, flex the spine, bringing your arms back over your head to perform a simultaneous crunch motion. After a brief pause, return to the starting position.",
    "thumbnail": "https://i.ytimg.com/vi/MWC2ZEs0I_g/hq720.jpg",
    "kcal": 87,
    "duration": 27,
    "level": "Intermediate",
    "video": "https://www.youtube.com/watch?v=MWC2ZEs0I_g"
  },
  {
    "name": "Cross-Body Crunch",
    "type": "strength",
    "muscle": "stomach",
    "equipment": "body_only",
    "instructions": "Lie flat on your back and bend your knees about 60 degrees. Keep your feet flat on the floor and place your hands loosely behind your head. This will be your starting position. Now curl up and bring your right elbow and shoulder across your body while bring your left knee in toward your left shoulder at the same time. Reach with your elbow and try to touch your knee. Exhale as you perform this movement. Tip: Try to bring your shoulder up towards your knee rather than just your elbow and remember that the key is to contract the abs as you perform the movement; not just to move the elbow. Now go back down to the starting position as you inhale and repeat with the left elbow and the right knee. Continue alternating in this manner until all prescribed repetitions are done.  Variation: You can also do all of your repetitions for one side and then switch to the other side.",
    "thumbnail": "https://i.ytimg.com/vi/aUV3UF9huYc/hqdefault.jpg",
    "kcal": 78,
    "duration": 13,
    "level": "Intermediate",
    "video": "https://www.youtube.com/watch?v=aUV3UF9huYc"
  },
  {
    "name": "Single-arm high-cable side bend",
    "type": "strength",
    "muscle": "stomach",
    "equipment": "cable",
    "instructions": "Connect a standard handle to a tower. Move cable to highest pulley position. Stand with side to cable. With one hand, reach up and grab handle with underhand grip. Pull down cable until elbow touches your side and the handle is by your shoulder. Position feet hip-width apart. Place free hand on hip to help gauge pivot point. Keep arm in static position. Contract oblique to bring the weight down in a side crunch. Once you reach maximum contraction, slowly release the weight to the starting position. The weight stack should never be unloaded in a resting position. The aim is constant tension during the set. Repeat to failure. Then, reposition and repeat the same series of movements on the opposite side.  Tip: Keep your arm tucked in tight to your side; don’t move it. This technique will ensure the weight is isolated directly to the obliques and not your biceps or shoulder.",
    "thumbnail": "https://i.ytimg.com/vi/oPrzDzY1DKA/hqdefault.jpg",
    "kcal": 85,
    "duration": 20,
    "level": "Intermediate",
    "video": "https://www.youtube.com/watch?v=oPrzDzY1DKA"
  },
  {
    "name": "Elbow-to-knee crunch",
    "type": "strength",
    "muscle": "stomach",
    "equipment": "body_only",
    "instructions": "Lie on the floor, crossing your right leg across your bent left knee. Clasp your hands behind your head, beginning with your shoulder blades on the ground. This will be your starting position. Perform the motion by flexing the spine and rotating your torso to bring the left elbow to the right knee. Return to the starting position and repeat the movement for the desired number of repetitions before switching sides.",
    "thumbnail": "https://i.ytimg.com/vi/FcjwuLMdGyM/hq720.jpg",
    "kcal": 86,
    "duration": 14,
    "level": "Intermediate",
    "video": "https://www.youtube.com/watch?v=FcjwuLMdGyM"
  },
  {
    "name": "Decline Crunch",
    "type": "strength",
    "muscle": "stomach",
    "equipment": "body_only",
    "instructions": "Secure your legs at the end of the decline bench and lie down. Now place your hands lightly on either side of your head keeping your elbows in. Tip: Don't lock your fingers behind your head. While pushing the small of your back down in the bench to better isolate your abdominal muscles, begin to roll your shoulders off it. Continue to push down as hard as you can with your lower back as you contract your abdominals and exhale. Your shoulders should come up off the bench only about four inches, and your lower back should remain on the bench. At the top of the movement, contract your abdominals hard and keep the contraction for a second. Tip: Focus on slow, controlled movement - don't cheat yourself by using momentum. After the one second contraction, begin to come down slowly again to the starting position as you inhale. Repeat for the recommended amount of repetitions.  Variations: There are many variations for the crunch. You can perform the exercise with weights, or on top of an exercise ball or on a flat bench.",
    "thumbnail": "https://i.ytimg.com/vi/7k0bjxweJJs/hqdefault.jpg",
    "kcal": 120,
    "duration": 30,
    "level": "Intermediate",
    "video": "https://www.youtube.com/watch?v=7k0bjxweJJs"
  },
  {
    "name": "Hanging toes-to-bar",
    "type": "strength",
    "muscle": "stomach",
    "equipment": "body_only",
    "instructions": "Hang from a chin-up bar with your legs and feet together using an overhand grip (palms facing away from you) that is slightly wider than shoulder width. Tip: You may use wrist wraps in order to facilitate holding on to the bar. Now bend your knees at a 90 degree angle and bring the upper legs forward so that the calves are perpendicular to the floor while the thighs remain parallel to it. This will be your starting position. Pull your legs up as you exhale until you almost touch your shins with the bar above you. Tip: Try to straighten your legs as much as possible while at the top. Lower your legs as slowly as possible until you reach the starting position. Tip: Avoid swinging and using momentum at all times. Repeat for the recommended amount of repetitions.  Variations: You can perform this exercise with ankle weights in order to make it more challenging.",
    "thumbnail": "https://i.ytimg.com/vi/v6dgseykbLI/hq720.jpg",
    "kcal": 66,
    "duration": 23,
    "level": "Intermediate",
    "video": "https://www.youtube.com/watch?v=v6dgseykbLI"
  },
  {
    "name": "Kneeling cable oblique crunch",
    "type": "strength",
    "muscle": "stomach",
    "equipment": "cable",
    "instructions": "Connect a rope attachment to a high pulley cable and position the mat on the floor in front of you. Take the rope with both hands and kneel approximately 1-2 feet from the column. Position the rope behind your head; your hands being next to your ears. This will be your starting position. Keeping your hands in place, pull the rope downward in a crunching motion. As you flex the spine, twist to bring your elbow to the opposite knee. Pause briefly at the bottom of the motion, and then return to the starting position.",
    "thumbnail": "https://i.ytimg.com/vi/xUulEXD1AQc/hq720.jpg",
    "kcal": 116,
    "duration": 16,
    "level": "Intermediate",
    "video": "https://www.youtube.com/watch?v=xUulEXD1AQc"
  },
  {
    "name": "Hanging Oblique Knee Raise",
    "type": "strength",
    "muscle": "stomach",
    "equipment": "body_only",
    "instructions": "Take a grip on pull-ups bars; hang with your knees together and your body straight. This will be your starting position. Initiate the movement by flexing the hips and knees, drawing the legs up. Pull the knees up into one side, going above 90 degrees at the hip. Avoid any swinging, performing the exercise with control. Return to the starting position and then perform the movement to the other side. Continue alternating until the set in complete.",
    "thumbnail": "https://i.ytimg.com/vi/L1rt7qr5LCk/hq720.jpg",
    "kcal": 131,
    "duration": 23,
    "level": "Intermediate",
    "video": "https://www.youtube.com/watch?v=L1rt7qr5LCk"
  },
  {
    "name": "Dumbbell suitcase crunch",
    "type": "strength",
    "muscle": "stomach",
    "equipment": "medicine_ball",
    "instructions": "Begin by lying on your back on the ground. Your legs should be straight and your arms extended behind your head holding a medicine ball. This will be your starting position. To perform the movement, tuck the knees toward your chest, rotating your pelvis to lift your glutes from the floor. As you do so, flex the spine, bringing your arms back over your head to perform a simultaneous crunch motion. After a brief pause, return to the starting position.",
    "thumbnail": "https://i.ytimg.com/vi/3SUtOSaOn1M/hq720.jpg",
    "kcal": 78,
    "duration": 11,
    "level": "Intermediate",
    "video": "https://www.youtube.com/watch?v=3SUtOSaOn1M"
  },
  {
    "name": "Plate Twist",
    "type": "strength",
    "muscle": "stomach",
    "equipment": "other",
    "instructions": "Lie down on the floor or an exercise mat with your legs fully extended and your upper body upright. Grab the plate by its sides with both hands out in front of your abdominals with your arms slightly bent. Slowly cross your legs near your ankles and lift them up off the ground. Your knees should also be bent slightly. Note: Move your upper body back slightly to help keep you balanced turning this exercise. This is the starting position. Move the plate to the left side and touch the floor with it. Breathe out as you perform that movement. Come back to the starting position as you breathe in and then repeat the movement but this time to the right side of the body. Tip: Use a slow controlled movement at all times. Jerking motions can injure the back. Repeat for the recommended amount of repetitions.",
    "thumbnail": "https://i.ytimg.com/vi/bCQ6TwT2t-4/hq720.jpg",
    "kcal": 100,
    "duration": 28,
    "level": "Beginner",
    "video": "https://www.youtube.com/watch?v=bCQ6TwT2t-4"
  }
]